sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
/*!
    \file    gd32a7xx_can.c
    \brief   CAN driver

    \version 2025-02-14, V0.2.1, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_can.h"

/* DLC to data size in bytes definitions */
static const uint8_t dlc_to_databytes[16] = {0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 12U, 16U, 20U, 24U, 32U, 48U, 64U};
static const uint8_t fifo_element_sz[8] = {16U, 20U, 24U, 28U, 32U, 40U, 56U, 72U};

/* write data to destination array */
static void can_data_write(uint32_t dest[], uint8_t src[], uint32_t len);
/* computes the dlc field value, given a payload size (in bytes) */
static uint32_t can_dlc_value_compute(uint32_t payload_size);
/* receive CAN message from a specific memory address */
static can_receive_message_struct can_receive_by_addr(uint32_t addr);
/* convert DTM_CANx to CAN */
static uint32_t can_dtm_to_can(can_dtm_canx_enum dtm_canx);

/* private constants */
#define CAN_TIMEOUT_COUNT              ((uint32_t)0x0000FFFFU)   /*!< CAN timeout count value */
#define CAN_MERRSTAT_NCE_MASK          ((uint32_t)0x07000000U)   /*!< noncorrectable error mask */
#define CAN_TDCV_MASK                  ((uint16_t)0x007FU)       /*!< transmitter delay compensation value mask */

#define CAN_FLITER_ES_STD              ((uint32_t)0x00000004U)   /*!< standard filter element size */
#define CAN_FLITER_ES_EXT              ((uint32_t)0x00000008U)   /*!< extended filter element size */

#define CAN_ID_EXT_MASK                ((uint32_t)0x1FFFFFFFU)   /*!< extended identifier */
#define CAN_ID_STD_MASK                ((uint32_t)0x000007FFU)   /*!< standard identifier */
#define CAN_ID_STD_OFFSET              (18U)                     /*!< standard identifier offset */

#define TX_MM_HIGH_OFFSET              (8U)                      /*!< message marker high byte offset */
#define TX_MM_LOW_OFFSET               (24U)                     /*!< message marker low byte offset */

#define CAN_M_CAN_TEST_TXBNP_OFFSET    (8U)                      /*!< bit offset of TXBNP in CAN_M_CAN_TEST */
#define CAN_M_CAN_TEST_TXBNS_OFFSET    (16U)                     /*!< bit offset of TXBNS in CAN_M_CAN_TEST */

#define CAN_M_CAN_RWD_WDV_OFFSET       (8U)                      /*!< bit offset of WDV in CAN_M_CAN_RWD */

#define CAN_M_CAN_PSR_DLEC_OFFSET      ((uint32_t)0x00000008U)   /*!< bit offset of DLEC in CAN_M_CAN_PSR */
#define CAN_M_CAN_PSR_ACT_OFFSET       ((uint32_t)0x00000003U)   /*!< bit offset of ACT in CAN_M_CAN_PSR */

#define CAN_M_CAN_CCCR_WMM_OFFSET      (11U)                     /*!< bit offset of WMM in CAN_M_CAN_CCCR */
#define CAN_E0_RTR_OFFSET              (29U)                     /*!< bit offset of RTR in CAN_E0 */
#define CAN_E0_XTD_OFFSET              (30U)                     /*!< bit offset of XTD in CAN_E0 */
#define CAN_E0_ESI_OFFSET              (31U)                     /*!< bit offset of ESI in CAN_E0 */
#define CAN_E1_DLC_OFFSET              (16U)                     /*!< bit offset of DLC in CAN_E1 */
#define CAN_E1_BRS_OFFSET              (20U)                     /*!< bit offset of BRS in CAN_E1 */
#define CAN_E1_FDF_OFFSET              (21U)                     /*!< bit offset of FDF in CAN_E1 */
#define CAN_E1_ET_OFFSET               (22U)                     /*!< bit offset of ET in CAN_E1 */
#define CAN_E1_MM_LOW_OFFSET           (24U)                     /*!< bit offset of MM_LOW in CAN_E1 */

#define CAN_DMUI_RX0R_OFFSET           (1U)                      /*!< bit offset of RX0R in CAN_DMU_DMUI */
#define CAN_DMUI_RX1R_OFFSET           (2U)                      /*!< bit offset of RX1R in CAN_DMU_DMUI */
#define CAN_DMUI_TXER_OFFSET           (3U)                      /*!< bit offset of TXER in CAN_DMU_DMUI */
#define CAN_DMUI_TFQPIP_OFFSET         (8U)                      /*!< bit offset of TFQPIP in CAN_DMU_DMUI */
#define CAN_DMUI_ENA_OFFSET            (15U)                     /*!< bit offset of ENA in CAN_DMU_DMUI */
#define CAN_DMUI_EHS_OFFSET            (24U)                     /*!< bit offset of EHS in CAN_DMU_DMUI */
#define CAN_DMUI_TX_OFFSET             (28U)                     /*!< bit offset of TX in CAN_DMU_DMUI */
#define CAN_DMUI_RX0_OFFSET            (29U)                     /*!< bit offset of RX0 in CAN_DMU_DMUI */
#define CAN_DMUI_RX1_OFFSET            (30U)                     /*!< bit offset of RX1 in CAN_DMU_DMUI */
#define CAN_DMUI_TXE_OFFSET            (31U)                     /*!< bit offset of TXE in CAN_DMU_DMUI */

#define CAN_R0_RTR_OFFSET              (29U)                     /*!< bit offset of RTR in CAN_R0 */
#define CAN_R0_XTD_OFFSET              (30U)                     /*!< bit offset of XTD in CAN_R0 */
#define CAN_R0_ESI_OFFSET              (31U)                     /*!< bit offset of ESI in CAN_R0 */

#define CAN_R1A_DLC_OFFSET             (16U)                     /*!< bit offset of DLC in CAN_R1A */
#define CAN_R1A_BRS_OFFSET             (20U)                     /*!< bit offset of BRS in CAN_R1A */
#define CAN_R1A_FDF_OFFSET             (21U)                     /*!< bit offset of FDF in CAN_R1A */
#define CAN_R1A_FIDX_OFFSET            (24U)                     /*!< bit offset of FIDX in CAN_R1A */
#define CAN_R1A_ANMF_OFFSET            (31U)                     /*!< bit offset of ANMF in CAN_R1A */

/*!
    \brief      deinitialize CAN (API_ID(0x0001U))
                notice that only CAN cluster deinitialization is supported
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_deinit(can_dtm_canx_enum dtm_canx)
{
    /* determine which CAN is selected */
    switch(dtm_canx) {
    case DTM_CAN0:
    case DTM_CAN1:
        /* enable CAN_MERRCTL register write */
        CAN_CTL(CAN0) |= CAN_CTL_ECRWEN;
        /* clear RWDIS bit */
        CAN_MERRCTL(CAN0) &= ~CAN_MERRCTL_RWDIS;
        /* disable ECC */
        CAN_MERRCTL(CAN0) &= ~CAN_MERRCTL_ECCEN;
        /* disable DMA */
        CAN_CTL(CAN0) &= ~CAN_CTL_DMAEN0;
        CAN_CTL(CAN0) &= ~CAN_CTL_DMAEN1;
        /* enter INIT mode */
        can_operating_mode_enable(DTM_CAN0, CAN_MODE_INIT);
        can_operating_mode_enable(DTM_CAN1, CAN_MODE_INIT);
        /* reset CAN0 */
        rcu_periph_reset_enable(RCU_CAN0RST);
        rcu_periph_reset_disable(RCU_CAN0RST);
        break;
    case DTM_CAN2:
    case DTM_CAN3:
    case DTM_CAN4:
        /* enable CAN_MERRCTL register write */
        CAN_CTL(CAN1) |= CAN_CTL_ECRWEN;
        /* clear RWDIS bit */
        CAN_MERRCTL(CAN1) &= ~CAN_MERRCTL_RWDIS;
        /* disable ECC */
        CAN_MERRCTL(CAN1) &= ~CAN_MERRCTL_ECCEN;
        /* disable DMA */
        CAN_CTL(CAN1) &= ~CAN_CTL_DMAEN0;
        CAN_CTL(CAN1) &= ~CAN_CTL_DMAEN1;
        CAN_CTL(CAN1) &= ~CAN_CTL_DMAEN2;
        /* enter INIT mode */
        can_operating_mode_enable(DTM_CAN2, CAN_MODE_INIT);
        can_operating_mode_enable(DTM_CAN3, CAN_MODE_INIT);
        can_operating_mode_enable(DTM_CAN4, CAN_MODE_INIT);
        /* reset CAN1 */
        rcu_periph_reset_enable(RCU_CAN1RST);
        rcu_periph_reset_disable(RCU_CAN1RST);
        break;
    case DTM_CAN5:
    case DTM_CAN6:
    case DTM_CAN7:
        /* enable CAN_MERRCTL register write */
        CAN_CTL(CAN2) |= CAN_CTL_ECRWEN;
        /* clear RWDIS bit */
        CAN_MERRCTL(CAN2) &= ~CAN_MERRCTL_RWDIS;
        /* disable ECC */
        CAN_MERRCTL(CAN2) &= ~CAN_MERRCTL_ECCEN;
        /* disable DMA */
        CAN_CTL(CAN2) &= ~CAN_CTL_DMAEN0;
        CAN_CTL(CAN2) &= ~CAN_CTL_DMAEN1;
        CAN_CTL(CAN2) &= ~CAN_CTL_DMAEN2;
        /* enter INIT mode */
        can_operating_mode_enable(DTM_CAN5, CAN_MODE_INIT);
        can_operating_mode_enable(DTM_CAN6, CAN_MODE_INIT);
        can_operating_mode_enable(DTM_CAN7, CAN_MODE_INIT);
        /* reset CAN2 */
        rcu_periph_reset_enable(RCU_CAN2RST);
        rcu_periph_reset_disable(RCU_CAN2RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      initialize CAN parameter structure with a default value (API_ID(0x0002U))
    \param[in]  type: the type of parameter struct
                only one parameter can be selected which is shown as below:
      \arg        CAN_INIT_STRUCT: CAN initialization parameter struct
      \arg        CAN_FD_INIT_STRUCT: CAN FD initialization parameter struct
      \arg        CAN_FILTER_STRUCT: CAN filter parameter struct
      \arg        CAN_FILTER_ELEMENT_STRUCT: ID filter element parameter struct
      \arg        CAN_RX_MESSAGE_STRUCT: received message parameter struct
      \arg        CAN_TX_MESSAGE_STRUCT: transmit message parameter struct
      \arg        CAN_TX_BUFFER_STRUCT: transmit buffer configuration parameter struct
      \arg        CAN_TXEV_FIFO_STRUCT: transmit event FIFO configuration parameter struct
      \arg        CAN_TXEV_ELEMENT_STRUCT: transmit event FIFO element parameter struct
      \arg        CAN_RX_FIFO_STRUCT: receive FIFO configuration parameter struct
      \arg        CAN_RX_BUFFER_STRUCT: receive buffer configuration parameter struct
      \arg        CAN_HIGHPRI_MESSAGE_STATE_STRUCT: high priority message state parameter struct
      \arg        CAN_ERR_COUNT_STRUCT: error counter parameter struct
      \arg        CAN_DMU_QUEUE_COUNT_STRUCT: DMU queue counter parameter struct
    \param[in]  p_struct: the pointer of the specific struct
    \param[out] none
    \retval     none
*/
void can_struct_para_init(can_struct_type_enum type, void *p_struct)
{
    uint8_t i;

    /* get type of the struct */
    switch(type) {
    /* CAN initialization parameter struct */
    case CAN_INIT_STRUCT:
        /* initialize CAN initialization parameter struct with default value */
        ((can_parameter_struct *)p_struct)->auto_retransmission_enable = ENABLE;
        ((can_parameter_struct *)p_struct)->transmit_pause_enable = DISABLE;
        ((can_parameter_struct *)p_struct)->edge_filter_enable = DISABLE;
        ((can_parameter_struct *)p_struct)->protocol_exception_enable = DISABLE;
        ((can_parameter_struct *)p_struct)->wide_message_enable = DISABLE;
        ((can_parameter_struct *)p_struct)->prescaler = 1U;
        ((can_parameter_struct *)p_struct)->resync_jump_width = 1U;
        ((can_parameter_struct *)p_struct)->time_segment_1 = 2U;
        ((can_parameter_struct *)p_struct)->time_segment_2 = 2U;
        ((can_parameter_struct *)p_struct)->filter_config = NULL;
        ((can_parameter_struct *)p_struct)->rx_fifo0_config = NULL;
        ((can_parameter_struct *)p_struct)->rx_fifo1_config = NULL;
        ((can_parameter_struct *)p_struct)->rx_buffer_config = NULL;
        ((can_parameter_struct *)p_struct)->tx_buffer_config = NULL;
        ((can_parameter_struct *)p_struct)->tx_event_fifo_config = NULL;
        break;
    /* CAN FD initialization parameter struct */
    case CAN_FD_INIT_STRUCT:
        /* initialize CAN FD initialization parameter struct with default value */
        ((can_fd_parameter_struct *)p_struct)->iso_can_fd_enable = DISABLE;
        ((can_fd_parameter_struct *)p_struct)->bitrate_switch_enable = DISABLE;
        ((can_fd_parameter_struct *)p_struct)->tdc_enable = DISABLE;
        ((can_fd_parameter_struct *)p_struct)->tdc_offset = 0U;
        ((can_fd_parameter_struct *)p_struct)->tdc_filter_window = 0U;
        ((can_fd_parameter_struct *)p_struct)->prescaler = 1U;
        ((can_fd_parameter_struct *)p_struct)->resync_jump_width = 1U;
        ((can_fd_parameter_struct *)p_struct)->time_segment_1 = 1U;
        ((can_fd_parameter_struct *)p_struct)->time_segment_2 = 2U;
        break;
    /* CAN filter parameter struct */
    case CAN_FILTER_STRUCT:
        /* initialize CAN filter parameter struct with default value */
        ((can_filter_struct *)p_struct)->and_mask_ext_frame = 0U;
        ((can_filter_struct *)p_struct)->non_match_std_frame_accept = CAN_ACCEPT_INTO_RXFIFO0;
        ((can_filter_struct *)p_struct)->non_match_ext_frame_accept = CAN_ACCEPT_INTO_RXFIFO0;
        ((can_filter_struct *)p_struct)->remote_std_frame_accept = CAN_REMOTE_FILTER;
        ((can_filter_struct *)p_struct)->remote_ext_frame_accept = CAN_REMOTE_FILTER;
        ((can_filter_struct *)p_struct)->filter_start_address_std_frame = 0U;
        ((can_filter_struct *)p_struct)->filter_start_address_ext_frame = 0U;
        ((can_filter_struct *)p_struct)->filter_number_std_frame = 0U;
        ((can_filter_struct *)p_struct)->filter_number_ext_frame = 0U;
        break;
    /* ID filter element parameter struct */
    case CAN_FILTER_ELEMENT_STRUCT:
        /* initialize standard ID filter element parameter struct with default value */
        ((can_filter_element_struct *)p_struct)->filter_type = CAN_FILTER_RANGE;
        ((can_filter_element_struct *)p_struct)->config = CAN_FILTER_DISABLE;
        ((can_filter_element_struct *)p_struct)->id1 = 0U;
        ((can_filter_element_struct *)p_struct)->id2_or_mask_or_rxbuffercfg = 0U;
        break;
    /* received message parameter struct */
    case CAN_RX_MESSAGE_STRUCT:
        /* initialize received message parameter struct with default value */
        ((can_receive_message_struct *)p_struct)->id = 0U;
        ((can_receive_message_struct *)p_struct)->rtr = (uint32_t)CAN_FT_DATA;
        ((can_receive_message_struct *)p_struct)->xtd = (uint32_t)CAN_FF_STANDARD;
        ((can_receive_message_struct *)p_struct)->esi = 0U;
        ((can_receive_message_struct *)p_struct)->timestamp = 0U;
        ((can_receive_message_struct *)p_struct)->dlc = 0U;
        ((can_receive_message_struct *)p_struct)->brs = CAN_BRS_DISABLE;
        ((can_receive_message_struct *)p_struct)->fdf = (uint32_t)CAN_CLASSIC_MODE;
        ((can_receive_message_struct *)p_struct)->filter_index = 0U;
        ((can_receive_message_struct *)p_struct)->non_match = CAN_MATCH_FILTER_FRAME;
        ((can_receive_message_struct *)p_struct)->data_bytes = 0U;

        for(i = 0U; i < 64U; i++) {
            ((can_receive_message_struct *)p_struct)->data[i] = 0U;
        }
        break;
    /* transmit message parameter struct */
    case CAN_TX_MESSAGE_STRUCT:
        /* initialize transmit message parameter struct with default value */
        ((can_transmit_message_struct *)p_struct)->id = 0U;
        ((can_transmit_message_struct *)p_struct)->rtr = CAN_FT_DATA;
        ((can_transmit_message_struct *)p_struct)->xtd = CAN_FF_STANDARD;
        ((can_transmit_message_struct *)p_struct)->esi = 0U;
        ((can_transmit_message_struct *)p_struct)->message_marker = 0U;
        ((can_transmit_message_struct *)p_struct)->brs = DISABLE;
        ((can_transmit_message_struct *)p_struct)->fdf = DISABLE;
        ((can_transmit_message_struct *)p_struct)->ev_fifo_control = CAN_TXEVENT_FIFO_DISABLE;
        ((can_transmit_message_struct *)p_struct)->data_bytes = 0U;

        for(i = 0U; i < 64U; i++) {
            ((can_transmit_message_struct *)p_struct)->data[i] = 0U;
        }
        break;
    /* transmit buffer configuration parameter struct */
    case CAN_TX_BUFFER_STRUCT:
        /* initialize transmit buffer configuration parameter struct with default value */
        ((can_tx_buffer_struct *)p_struct)->tx_buffer_start_address = 0U;
        ((can_tx_buffer_struct *)p_struct)->dedicate_buffer_size = 0U;
        ((can_tx_buffer_struct *)p_struct)->fifo_or_queue_mode = (uint16_t)CAN_TXFIFO_OPERATION;
        ((can_tx_buffer_struct *)p_struct)->fifo_or_queue_size = 0U;
        ((can_tx_buffer_struct *)p_struct)->tx_buffer_element_size = CAN_TXBS_8BYTES;
        break;
    /* transmit event FIFO configuration parameter struct */
    case CAN_TXEV_FIFO_STRUCT:
        /* initialize transmit event FIFO configuration parameter struct with default value */
        ((can_tx_event_fifo_struct *)p_struct)->fifo_watermark = 0U;
        ((can_tx_event_fifo_struct *)p_struct)->fifo_size = 0U;
        ((can_tx_event_fifo_struct *)p_struct)->fifo_start_address = 0U;
        break;
    /* transmit event FIFO element parameter struct */
    case CAN_TXEV_ELEMENT_STRUCT:
        /* initialize transmit event FIFO configuration parameter struct with default value */
        ((can_txev_fifo_element_struct *)p_struct)->id = 0U;
        ((can_txev_fifo_element_struct *)p_struct)->rtr = 0U;
        ((can_txev_fifo_element_struct *)p_struct)->xtd = 0U;
        ((can_txev_fifo_element_struct *)p_struct)->esi = 0U;
        ((can_txev_fifo_element_struct *)p_struct)->dlc = 0U;
        ((can_txev_fifo_element_struct *)p_struct)->data_length = 0U;
        ((can_txev_fifo_element_struct *)p_struct)->fdf = 0U;
        ((can_txev_fifo_element_struct *)p_struct)->brs = 0U;
        ((can_txev_fifo_element_struct *)p_struct)->event_type = CAN_NONE;
        ((can_txev_fifo_element_struct *)p_struct)->message_marker = 0U;
        ((can_txev_fifo_element_struct *)p_struct)->timestamp = 0U;
        break;
    /* receive FIFO configuration parameter struct */
    case CAN_RX_FIFO_STRUCT:
        /* initialize receive FIFO configuration parameter struct with default value */
        ((can_rx_fifo_struct *)p_struct)->fifo_operation_mode = (uint16_t)CAN_RXFIFO_BLOCKING;
        ((can_rx_fifo_struct *)p_struct)->fifo_watermark = 0U;
        ((can_rx_fifo_struct *)p_struct)->fifo_size = 0U;
        ((can_rx_fifo_struct *)p_struct)->fifo_start_address = 0U;
        ((can_rx_fifo_struct *)p_struct)->fifo_element_size = CAN_RXFS_8BYTES;
        break;
    /* receive buffer configuration parameter struct */
    case CAN_RX_BUFFER_STRUCT:
        /* initialize receive buffer configuration parameter struct with default value */
        ((can_rx_buffer_struct *)p_struct)->buffer_start_address = 0U;
        ((can_rx_buffer_struct *)p_struct)->buffer_element_size = CAN_RXBS_8BYTES;
        break;
    /* high priority message state parameter struct */
    case CAN_HIGHPRI_MESSAGE_STATE_STRUCT:
        /* initialize high priority message state parameter struct with default value */
        ((can_high_prio_message_state_struct *)p_struct)->storage_addr = 0U;
        ((can_high_prio_message_state_struct *)p_struct)->match_filter_addr = 0U;
        ((can_high_prio_message_state_struct *)p_struct)->storage_indicator = 0;
        break;
    /* error counter parameter struct */
    case CAN_ERR_COUNT_STRUCT:
        /* initialize error counter parameter struct with default value */
        ((can_error_cnt_struct *)p_struct)->rx_err_cnt = 0U;
        ((can_error_cnt_struct *)p_struct)->tx_err_cnt = 0U;
        ((can_error_cnt_struct *)p_struct)->err_logging = 0U;
        ((can_error_cnt_struct *)p_struct)->rx_err_passive = RESET;
        break;
    /* DMU queue counter parameter struct */
    case CAN_DMU_QUEUE_COUNT_STRUCT:
        /* initialize DMU queue counter parameter struct with default value */
        ((can_dmu_queue_cnt_struct *)p_struct)->tx_enqueue_cnt = 0U;
        ((can_dmu_queue_cnt_struct *)p_struct)->rx0_dequeue_cnt = 0U;
        ((can_dmu_queue_cnt_struct *)p_struct)->rx1_dequeue_cnt = 0U;
        ((can_dmu_queue_cnt_struct *)p_struct)->tx_event_dequeue_cnt = 0U;
        break;
    default:
        break;
    }
}

/*!
    \brief      initialize CAN (API_ID(0x0003U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  can_parameter: CAN initialization parameter struct
                  auto_retransmission_enable: ENABLE, DISABLE
                  transmit_pause_enable: ENABLE, DISABLE
                  edge_filter_enable: ENABLE, DISABLE
                  protocol_exception_enable: ENABLE, DISABLE
                  wide_message_enable: ENABLE, DISABLE
                  prescaler: 1~512
                  resync_jump_width: 1~128
                  time_segment_1: 2~256
                  time_segment_2: 2~128
                  filter_config: filter configuration
                    and_mask_ext_frame: 0~0x1FFFFFFF
                    non_match_std_frame_accept: CAN_ACCEPT_INTO_RXFIFO0, CAN_ACCEPT_INTO_RXFIFO1, CAN_REJECT_NON_MATCHING
                    non_match_ext_frame_accept: CAN_ACCEPT_INTO_RXFIFO0, CAN_ACCEPT_INTO_RXFIFO1, CAN_REJECT_NON_MATCHING
                    remote_std_frame_accept: CAN_REMOTE_FILTER, CAN_REMOTE_REJECT
                    remote_ext_frame_accept: CAN_REMOTE_FILTER, CAN_REMOTE_REJECT
                    filter_start_address_std_frame: 0~0xFFFF
                    filter_start_address_ext_frame: 0~0xFFFF
                    filter_number_std_frame: 0~128
                    filter_number_ext_frame: 0~64
                  rx_fifo_config: Rx FIFO configuration
                    fifo_operation_mode: CAN_RXFIFO_BLOCKING, CAN_RXFIFO_OVERWRITE
                    fifo_watermark: 0~0x40
                    fifo_size: 0~0x40
                    fifo_start_address: 0~0xFFFF
                    fifo_element_size: CAN_RXFS_8BYTES, CAN_RXFS_12BYTES, CAN_RXFS_16BYTES, CAN_RXFS_20BYTES, CAN_RXFS_24BYTES,
                                       CAN_RXFS_32BYTES, CAN_RXFS_48BYTES, CAN_RXFS_64BYTES
                  rx_buffer_config: Rx buffer configuration
                    buffer_start_address: 0~0xFFFF
                    buffer_element_size: CAN_RXBS_8BYTES, CAN_RXBS_12BYTES, CAN_RXBS_16BYTES, CAN_RXBS_20BYTES, CAN_RXBS_24BYTES,
                                         CAN_RXBS_32BYTES, CAN_RXBS_48BYTES, CAN_RXBS_64BYTES
                  tx_buffer_config: Tx buffer configuration
                    tx_buffer_start_address: 0~0xFFFF
                    dedicate_buffer_size: 0~32
                    fifo_or_queue_mode: CAN_TXFIFO_OPERATION, CAN_TXQUEUE_OPERATION
                    fifo_or_queue_size: 0~32
                    tx_buffer_element_size: CAN_TXBS_8BYTES, CAN_TXBS_12BYTES, CAN_TXBS_16BYTES, CAN_TXBS_20BYTES, CAN_TXBS_24BYTES,
                                            CAN_TXBS_32BYTES, CAN_TXBS_48BYTES, CAN_TXBS_64BYTES
                  tx_event_fifo_config: Tx event FIFO configuration
                    fifo_watermark: 0~32
                    fifo_size: 0~32
                    fifo_start_address: 0~0xFFFF
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_init(can_dtm_canx_enum dtm_canx, can_parameter_struct *can_parameter)
{
    uint32_t timeout = CAN_TIMEOUT_COUNT;
    uint32_t reg_val;
    ErrStatus reval = SUCCESS;
    uint32_t can_periph = (uint32_t)dtm_canx;

