sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    /* check can_parameter pointer is NULL */
    if(NULL == can_parameter) {
        reval = ERROR;
    } else {
        /* enable initialization mode */
        CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_INIT;

        /* wait until initialization mode is entered */
        while((0U == (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_INIT)) && (0U != timeout)) {
            timeout--;
        }

        /* check the entering of initialization mode */
        if(0U == (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_INIT)) {
            reval =  ERROR;
        } else {
            /* enable configuration change */
            CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_CCE;

            /* set the automatic retransmission */
            if(DISABLE != can_parameter->auto_retransmission_enable) {
                CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_DAR;
            } else {
                CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_DAR;
            }

            /* set the transmit pause */
            if(DISABLE != can_parameter->transmit_pause_enable) {
                CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_TXP;
            } else {
                CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_TXP;
            }

            /* set the edge filtering during bus integration */
            if(DISABLE != can_parameter->edge_filter_enable) {
                CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_EFBI;
            } else {
                CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_EFBI;
            }

            /* set the protocol exception handling */
            if(DISABLE != can_parameter->protocol_exception_enable) {
                CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_PXHD;
            } else {
                CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_PXHD;
            }

            /* set the wide message mark handling */
            if(DISABLE != can_parameter->wide_message_enable) {
                CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_WMM;
            } else {
                CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_WMM;
            }

            /* configure bit timing parameters */
            reg_val = CAN_M_CAN_NBTP(can_periph);
            reg_val &= ~(CAN_M_CAN_NBTP_NSJW | CAN_M_CAN_NBTP_NBRP | CAN_M_CAN_NBTP_NTSEG1 | CAN_M_CAN_NBTP_NTSEG2);
            reg_val |= (((uint32_t)NBTP_NSJW(can_parameter->resync_jump_width - 1U)) | \
                        ((uint32_t)NBTP_NBRP(can_parameter->prescaler - 1U)) | \
                        ((uint32_t)NBTP_NTSEG1(can_parameter->time_segment_1 - 1U)) | \
                        ((uint32_t)NBTP_NTSEG2(can_parameter->time_segment_2 - 1U)));
            CAN_M_CAN_NBTP(can_periph) = reg_val;

            /* configure filter parameters if provided */
            if(NULL != can_parameter->filter_config) {
                /* configure standard ID filter settings */
                can_parameter->filter_config->filter_start_address_std_frame = can_parameter->filter_config->filter_start_address_std_frame >> 2U;
                CAN_M_CAN_SIDFC(can_periph) = (((uint32_t)SIDFC_FLSSA(can_parameter->filter_config->filter_start_address_std_frame)) | \
                                               ((uint32_t)SIDFC_LSS(can_parameter->filter_config->filter_number_std_frame)));

                /* configure extended ID filter settings */
                can_parameter->filter_config->filter_start_address_ext_frame = can_parameter->filter_config->filter_start_address_ext_frame >> 2U;
                CAN_M_CAN_XIDFC(can_periph) = (((uint32_t)XIDFC_FLESA(can_parameter->filter_config->filter_start_address_ext_frame)) | \
                                               ((uint32_t)XIDFC_LSE(can_parameter->filter_config->filter_number_ext_frame)));

                /* configure extended ID AND mask */
                CAN_M_CAN_XIDAM(can_periph) = (uint32_t)XIDAM_EIDM(can_parameter->filter_config->and_mask_ext_frame);

                /* configure global filter settings */
                reg_val = CAN_M_CAN_GFC(can_periph);
                reg_val &= ~(CAN_M_CAN_GFC_RRFE | CAN_M_CAN_GFC_RRFS | CAN_M_CAN_GFC_ANFE | CAN_M_CAN_GFC_ANFS);

                /* set remote frames settings */
                if(CAN_REMOTE_FILTER != can_parameter->filter_config->remote_ext_frame_accept) {
                    reg_val |= CAN_M_CAN_GFC_RRFE;
                }

                if(CAN_REMOTE_FILTER != can_parameter->filter_config->remote_std_frame_accept) {
                    reg_val |= CAN_M_CAN_GFC_RRFS;
                }

                /* set non-matching frames settings */
                reg_val |= (((uint32_t)GFC_ANFE(can_parameter->filter_config->non_match_ext_frame_accept)) | \
                            ((uint32_t)GFC_ANFS(can_parameter->filter_config->non_match_std_frame_accept)));

                CAN_M_CAN_GFC(can_periph) = reg_val;
            }

            /* configure Rx FIFO 0 parameters if provided */
            if(NULL != can_parameter->rx_fifo0_config) {
                /* configure Rx FIFO 0 */
                can_parameter->rx_fifo0_config->fifo_start_address = can_parameter->rx_fifo0_config->fifo_start_address >> 2U;
                CAN_M_CAN_RXF0C(can_periph) = (((uint32_t)RXFXC_FSA(can_parameter->rx_fifo0_config->fifo_start_address)) | \
                                               ((uint32_t)RXFXC_FS(can_parameter->rx_fifo0_config->fifo_size)) | \
                                               ((uint32_t)RXFXC_FWM(can_parameter->rx_fifo0_config->fifo_watermark)) | \
                                               ((uint32_t)(can_parameter->rx_fifo0_config->fifo_operation_mode)));

                /* configure Rx FIFO 0 element size */
                CAN_M_CAN_RXESC(can_periph) &= ~CAN_M_CAN_RXESC_F0DS;
                CAN_M_CAN_RXESC(can_periph) |= ((uint32_t)RXESC_F0DS(can_parameter->rx_fifo0_config->fifo_element_size));
            }

            /* configure Rx FIFO 1 parameters if provided */
            if(NULL != can_parameter->rx_fifo1_config) {
                /* configure Rx FIFO 1 */
                can_parameter->rx_fifo1_config->fifo_start_address = can_parameter->rx_fifo1_config->fifo_start_address >> 2U;
                CAN_M_CAN_RXF1C(can_periph) = (((uint32_t)RXFXC_FSA(can_parameter->rx_fifo1_config->fifo_start_address)) | \
                                               ((uint32_t)RXFXC_FS(can_parameter->rx_fifo1_config->fifo_size)) | \
                                               ((uint32_t)RXFXC_FWM(can_parameter->rx_fifo1_config->fifo_watermark)) | \
                                               ((uint32_t)(can_parameter->rx_fifo1_config->fifo_operation_mode)));

                /* configure Rx FIFO 1 element size */
                CAN_M_CAN_RXESC(can_periph) &= ~CAN_M_CAN_RXESC_F1DS;
                CAN_M_CAN_RXESC(can_periph) |= ((uint32_t)RXESC_F1DS(can_parameter->rx_fifo1_config->fifo_element_size));
            }

            /* configure Rx buffer parameters if provided */
            if(NULL != can_parameter->rx_buffer_config) {
                /* configure Rx buffer */
                can_parameter->rx_buffer_config->buffer_start_address = can_parameter->rx_buffer_config->buffer_start_address >> 2U;
                CAN_M_CAN_RXBC(can_periph) = ((uint32_t)RXBC_RBSA(can_parameter->rx_buffer_config->buffer_start_address));

                /* configure Rx buffer element size */
                CAN_M_CAN_RXESC(can_periph) &= ~CAN_M_CAN_RXESC_RBDS;
                CAN_M_CAN_RXESC(can_periph) |= ((uint32_t)RXESC_RBDS(can_parameter->rx_buffer_config->buffer_element_size));
            }

