sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
            /* configure Tx buffer parameters if provided */
            if(NULL != can_parameter->tx_buffer_config) {
                if((can_parameter->tx_buffer_config->fifo_or_queue_size + can_parameter->tx_buffer_config->dedicate_buffer_size) > 32U) {
                    reval = ERROR;
                } else {
                    /* configure Tx buffer */
                    can_parameter->tx_buffer_config->tx_buffer_start_address = can_parameter->tx_buffer_config->tx_buffer_start_address >> 2U;
                    CAN_M_CAN_TXBC(can_periph) = (((uint32_t)TXBC_TBSA(can_parameter->tx_buffer_config->tx_buffer_start_address)) | \
                                                  ((uint32_t)TXBC_NDTB(can_parameter->tx_buffer_config->dedicate_buffer_size)) | \
                                                  ((uint32_t)TXBC_TFQS(can_parameter->tx_buffer_config->fifo_or_queue_size)) | \
                                                  ((uint32_t)(can_parameter->tx_buffer_config->fifo_or_queue_mode)));

                    /* configure Tx buffer element size */
                    CAN_M_CAN_TXESC(can_periph) = ((uint32_t)TXESC_TBDS(can_parameter->tx_buffer_config->tx_buffer_element_size));
                }
            }

            /* configure Tx event FIFO parameters if provided */
            if(NULL != can_parameter->tx_event_fifo_config) {
                /* configure Tx event FIFO */
                can_parameter->tx_event_fifo_config->fifo_start_address = can_parameter->tx_event_fifo_config->fifo_start_address >> 2U;
                CAN_M_CAN_TXEFC(can_periph) = (((uint32_t)TXEFC_EFSA(can_parameter->tx_event_fifo_config->fifo_start_address)) | \
                                               ((uint32_t)TXEFC_EFS(can_parameter->tx_event_fifo_config->fifo_size)) | \
                                               ((uint32_t)TXEFC_EFWM(can_parameter->tx_event_fifo_config->fifo_watermark)));
            }

            /* exit initialization mode */
            CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_INIT;
        }
    }

    return reval;
}

/*!
    \brief      get SRAM initialization state (API_ID(0x0004U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_sram_init_state_get(can_dtm_canx_enum dtm_canx)
{
    FlagStatus ret = RESET;
    uint32_t can_periph;

    /* determine which DTM_CAN is selected */
    can_periph = can_dtm_to_can(dtm_canx);

    /* check if SRAM initialization is done */
    if(0U != (CAN_MRAM(can_periph) & CAN_MRAM_IRF)) {
        ret = SET;
    }
    return ret;
}

/*!
    \brief      add standard message ID filter element (API_ID(0x0005U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  frame_format: frame format
      \arg        CAN_FF_STANDARD: standard format filter
      \arg        CAN_FF_EXTENDED: extended format filter
    \param[in]  element_index: ID filter element index
      \arg        min value: 0
      \arg        max value: filter_number_std_frame - 1 or filter_number_ext_frame
    \param[in]  filter: ID filter element parameter struct
                  filter_type: CAN_FILTER_RANGE, CAN_FILTER_DUAL, CAN_FILTER_MASK, CAN_FILTER_RANGE_NOMASK_DISABLE
                  config: CAN_FILTER_DISABLE, CAN_FILTER_TO_RXFIFO0, CAN_FILTER_TO_RXFIFO1, CAN_FILTER_REJECT,
                          CAN_FILTER_HP, CAN_FILTER_TO_RXFIFO0_HP, CAN_FILTER_TO_RXFIFO1_HP, CAN_FILTER_TO_RXBUFFER
                  id1: 0~0x7FF or 0~0x1FFFFFFF
                  id2_or_mask_or_rxbuffercfg: 0~0x7FF or 0~0x1FFFFFFF
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_filter_set(can_dtm_canx_enum dtm_canx, can_ff_enum frame_format, uint8_t element_index, can_filter_element_struct *filter)
{
    uint32_t sxidfc_reg;
    uint32_t filter_start_address;
    uint32_t filter_number;
    uint32_t filter_address;
    uint32_t *filter_element_addr;
    uint32_t each_element_size;
    uint32_t mem_start_address;
    ErrStatus status = SUCCESS;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* check input parameters */
    if(NULL == filter) {
        status = ERROR;
    } else {
        if(CAN_FF_STANDARD == frame_format) {
            /* get filter list standard start address and filter number */
            sxidfc_reg = CAN_M_CAN_SIDFC(can_periph);
            filter_start_address = GET_SIDFC_FLSSA(sxidfc_reg) * 4U;
            filter_number = GET_SIDFC_LSS(sxidfc_reg);
            each_element_size = CAN_FLITER_ES_STD;
        } else {
            /* get filter list extended start address and filter number */
            sxidfc_reg = CAN_M_CAN_XIDFC(can_periph);
            filter_start_address = GET_XIDFC_FLESA(sxidfc_reg) * 4U;
            filter_number = GET_XIDFC_LSE(sxidfc_reg);
            each_element_size = CAN_FLITER_ES_EXT;
        }

        /* check element index */
        if(element_index >= filter_number) {
            status = ERROR;
        } else {
            mem_start_address = can_dtm_to_can(dtm_canx);
            /* calculate filter element address */
            filter_address = filter_start_address + (element_index * each_element_size);
            filter_element_addr = (uint32_t *)(mem_start_address + filter_address);

            /* write filter element values */
            if(CAN_FF_STANDARD == frame_format) {
                *filter_element_addr = (SFET_SFT((uint32_t)filter->filter_type) |
                                        SFET_SFEC((uint32_t)filter->config) |
                                        SFET_SFID1(filter->id1) |
                                        SFET_SFID2(filter->id2_or_mask_or_rxbuffercfg));
            } else {
                /* write filter element values - first word */
                *filter_element_addr = (EFET_EFEC((uint32_t)filter->config) |
                                        EFET_EFID1(filter->id1));

                /* write filter element values - second word */
                filter_element_addr++;
                *filter_element_addr = (EFET_EFT((uint32_t)filter->filter_type) |
                                        EFET_EFID2(filter->id2_or_mask_or_rxbuffercfg));
            }
        }
    }

