sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    return status;
}

/*!
    \brief      enable selected operating mode (API_ID(0x0006U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  mode: the operating mode
                only one parameter can be selected which is shown as below:
      \arg        CAN_MODE_NORMAL: normal operation mode
      \arg        CAN_MODE_INIT: initialization mode
      \arg        CAN_MODE_SLEEP: sleep mode
      \arg        CAN_MODE_MONITOR: bus monitoring mode
      \arg        CAN_MODE_RESTRICTED: restricted operation mode
      \arg        CAN_MODE_TEST: test mode
      \arg        CAN_MODE_EXTERNAL_LOOPBACK: external loopback mode
      \arg        CAN_MODE_INTERNAL_LOOPBACK: internal loopback mode
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_operating_mode_enable(can_dtm_canx_enum dtm_canx, can_operating_mode_enum mode)
{
    uint32_t timeout = CAN_TIMEOUT_COUNT;
    uint32_t reg;
    ErrStatus reval = SUCCESS;
    uint32_t can_periph = (uint32_t)dtm_canx;

    if(CAN_MODE_SLEEP == mode) {
        /* enter sleep mode */
        CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_CSR;
        /* wait until sleep mode is entered */
        while((0U == (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_CSA)) && (0U != timeout)) {
            timeout--;
        }
        /* check the entering of sleep mode */
        if(0U == (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_CSA)) {
            reval =  ERROR;
        }
    } else {
        /* enter initialization mode */
        CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_INIT;
        /* wait until initialization mode is entered */
        while((0U == (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_INIT)) && (0U != timeout)) {
            timeout--;
        }
        /* check the entering of initialization mode */
        if(0U == (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_INIT)) {
            reval =  ERROR;
        } else {
            CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_CCE;
            CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_CSR;
            /* wait until sleep mode is exit */
            while((0U != (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_CSA)) && (0U != timeout)) {
                timeout--;
            }
            /* check the sleep mode is exit */
            if(0U != (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_CSA)) {
                reval =  ERROR;
            } else if(CAN_MODE_INIT != mode) {
                reg = CAN_M_CAN_CCCR(can_periph);
                reg &= ~(CAN_M_CAN_CCCR_MON | CAN_M_CAN_CCCR_ASM);

                switch(mode) {
                case CAN_MODE_NORMAL:
                    /* enter normal operation mode */
                    reg &= ~CAN_M_CAN_CCCR_TEST;
                    CAN_M_CAN_CCCR(can_periph) = reg;
                    break;
                case CAN_MODE_RESTRICTED:
                    /* enter restricted operation mode */
                    reg &= ~CAN_M_CAN_CCCR_TEST;
                    reg |= CAN_M_CAN_CCCR_ASM;
                    CAN_M_CAN_CCCR(can_periph) = reg;
                    break;
                case CAN_MODE_MONITOR:
                    /* enter bus monitoring mode */
                    reg |= CAN_M_CAN_CCCR_MON;
                    CAN_M_CAN_CCCR(can_periph) = reg;
                    if(0U != (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_TEST)) {
                        CAN_M_CAN_TEST(can_periph) &= ~CAN_M_CAN_TEST_LBCK;
                    }
                    break;
                case CAN_MODE_TEST:
                    /* enter test mode */
                    reg |= CAN_M_CAN_CCCR_TEST;
                    CAN_M_CAN_CCCR(can_periph) = reg;
                    /* exit external or internal loopback mode */
                    CAN_M_CAN_TEST(can_periph) &= ~CAN_M_CAN_TEST_LBCK;
                    break;
                case CAN_MODE_EXTERNAL_LOOPBACK:
                    /* enter external loopback mode */
                    reg |= CAN_M_CAN_CCCR_TEST;
                    CAN_M_CAN_CCCR(can_periph) = reg;
                    CAN_M_CAN_TEST(can_periph) |= CAN_M_CAN_TEST_LBCK;
                    break;
                case CAN_MODE_INTERNAL_LOOPBACK:
                    /* first enter test mode */
                    reg |= CAN_M_CAN_CCCR_TEST | CAN_M_CAN_CCCR_MON;
                    CAN_M_CAN_CCCR(can_periph) = reg;
                    /* then enter internal loopback mode */
                    CAN_M_CAN_TEST(can_periph) |= CAN_M_CAN_TEST_LBCK;
                    break;
                default:
                    break;
                }

                /* exit initialization mode */
                CAN_M_CAN_CCCR(can_periph) &= ~(CAN_M_CAN_CCCR_INIT | CAN_M_CAN_CCCR_CCE);
            } else {
                /* initialization mode do nothing */
            }
        }
    }

    return reval;
}

/*!
    \brief      disable selected operating mode (API_ID(0x0007U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  mode: the operating mode
                only one parameter can be selected which is shown as below:
      \arg        CAN_MODE_INIT: initialization mode
      \arg        CAN_MODE_SLEEP: sleep mode
      \arg        CAN_MODE_MONITOR: bus monitoring mode
      \arg        CAN_MODE_RESTRICTED: restricted operation mode
      \arg        CAN_MODE_TEST: test mode
      \arg        CAN_MODE_EXTERNAL_LOOPBACK: external loopback mode
      \arg        CAN_MODE_INTERNAL_LOOPBACK: internal loopback mode
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_operating_mode_disable(can_dtm_canx_enum dtm_canx, can_operating_mode_enum mode)
{
    uint32_t timeout = CAN_TIMEOUT_COUNT;
    ErrStatus reval = SUCCESS;
    uint32_t can_periph = (uint32_t)dtm_canx;

    switch(mode) {
    case CAN_MODE_INIT:
        /* exit initialization mode */
        CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_INIT;
        /* wait until initialization mode is entered */
        while((0U != (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_INIT)) && (0U != timeout)) {
            timeout--;
        }
        /* check the entering of initialization mode */
        if(0U != (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_INIT)) {
            reval =  ERROR;
        }
        break;
    case CAN_MODE_SLEEP:
        /* exit sleep mode */
        CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_CSR;
        /* wait until sleep mode is exit */
        while((0U != (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_CSA)) && (0U != timeout)) {
            timeout--;
        }
        /* check the sleep mode is exit */
        if(0U != (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_CSA)) {
            reval =  ERROR;
        }
        break;
    case CAN_MODE_RESTRICTED:
        /* exit restricted operation mode */
        CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_ASM;
        break;
    case CAN_MODE_MONITOR:
        /* exit bus monitoring mode */
        CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_MON;
        break;
    case CAN_MODE_INTERNAL_LOOPBACK:
    case CAN_MODE_TEST:
    case CAN_MODE_EXTERNAL_LOOPBACK:
        if(CAN_MODE_INTERNAL_LOOPBACK == mode) {
            CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_MON;
        }
        /* enter initialization mode */
        CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_INIT;
        /* wait until initialization mode is entered */
        while((0U == (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_INIT)) && (0U != timeout)) {
            timeout--;
        }
        /* check the entering of initialization mode */
        if(0U == (CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_INIT)) {
            reval =  ERROR;
        } else {
            CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_CCE;
            /* exit test mode */
            CAN_M_CAN_CCCR(can_periph) &= ~CAN_M_CAN_CCCR_TEST;
        }
        /* exit initialization mode */
        CAN_M_CAN_CCCR(can_periph) &= ~(CAN_M_CAN_CCCR_INIT | CAN_M_CAN_CCCR_CCE);
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief      enable automatic retransmission (API_ID(0x0008U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_automatic_retransmission_enable(can_dtm_canx_enum dtm_canx)
{
    /* disable automatic retransmission mode */
    CAN_M_CAN_CCCR((uint32_t)dtm_canx) &= ~CAN_M_CAN_CCCR_DAR;
}

/*!
    \brief      disable automatic retransmission (API_ID(0x0009U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_automatic_retransmission_disable(can_dtm_canx_enum dtm_canx)
{
    /* enable automatic retransmission mode */
    CAN_M_CAN_CCCR((uint32_t)dtm_canx) |= CAN_M_CAN_CCCR_DAR;
}

/*!
    \brief      get Tx buffer number from CAN_M_CAN_TEST register (API_ID(0x000AU))
                notice to enter CAN_MODE_TEST mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  number_type: type of Tx buffer number to get
                only one parameter can be selected which is shown as below:
      \arg        CAN_TEST_TXBUF_LAST_STARTED: Tx buffer number which started last
      \arg        CAN_TEST_TXBUF_LAST_PREPARED: Tx buffer number which prepared last
    \param[out] none
    \retval     0~31 or 0xFF
*/
uint8_t can_test_txbuffer_number_get(uint32_t dtm_canx, uint32_t number_type)
{
    uint8_t number = 0xFFU;
    uint32_t can_periph = (uint32_t)dtm_canx;

