sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    if(CAN_TEST_TXBUF_LAST_STARTED == number_type) {
        /* check Tx buffer number started valid flag */
        if(0U != (CAN_M_CAN_TEST(can_periph) & CAN_M_CAN_TEST_SVAL)) {
            /* get Tx buffer number which started last */
            number = (uint8_t)((CAN_M_CAN_TEST(can_periph) & CAN_M_CAN_TEST_TXBNS) >> CAN_M_CAN_TEST_TXBNS_OFFSET);
        }
    } else if(CAN_TEST_TXBUF_LAST_PREPARED == number_type) {
        /* check Tx buffer number prepared valid flag */
        if(0U != (CAN_M_CAN_TEST(can_periph) & CAN_M_CAN_TEST_PVAL)) {
            /* get Tx buffer number which prepared last */
            number = (uint8_t)((CAN_M_CAN_TEST(can_periph) & CAN_M_CAN_TEST_TXBNP) >> CAN_M_CAN_TEST_TXBNP_OFFSET);
        }
    } else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }

    return number;
}

/*!
    \brief      configure CAN transmit pin output (API_ID(0x000BU))
                notice to enter CAN_MODE_TEST mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  tx_control: CAN transmit pin output control
                only one parameter can be selected which is shown as below:
      \arg        CAN_TX_CONTROL_NORMAL: CAN_TX pin is controlled by the CAN core
      \arg        CAN_TX_CONTROL_SAMPLE_POINT: sample point can be monitored at CAN_TX pin
      \arg        CAN_TX_CONTROL_DOMINANT: CAN_TX pin drives a dominant state (low)
      \arg        CAN_TX_CONTROL_RECESSIVE: CAN_TX pin drives a recessive state (high)
    \param[out] none
    \retval     none
*/
void can_test_transmit_pin_output_config(uint32_t dtm_canx, can_tx_control_enum tx_control)
{
    /* configure TX pin output control */
    CAN_M_CAN_TEST((uint32_t)dtm_canx) &= ~CAN_M_CAN_TEST_TX;
    CAN_M_CAN_TEST((uint32_t)dtm_canx) |= TEST_TX((uint32_t)tx_control);
}

/*!
    \brief      get CAN receive pin state (API_ID(0x000CU))
                notice to enter CAN_MODE_TEST mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus can_test_receive_pin_state_get(uint32_t dtm_canx)
{
    FlagStatus reval = RESET;

    if(0U != (CAN_M_CAN_TEST((uint32_t)dtm_canx) & CAN_M_CAN_TEST_RX)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      set CAN FD operation mode (API_ID(0x000DU))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  can_fd_para_init: CAN FD initialization parameter struct
                  iso_can_fd_enable: ENABLE, DISABLE
                  bitrate_switch_enable: ENABLE, DISABLE
                  tdc_enable: ENABLE, DISABLE
                  tdc_offset: 0~127
                  tdc_filter_window: 0~127
                  prescaler: 1~32
                  resync_jump_width: 1~16
                  time_segment_1: 1~32
                  time_segment_2: 2~16
    \param[out] none
    \retval     none
*/
void can_fd_config(can_dtm_canx_enum dtm_canx, can_fd_parameter_struct *can_fd_para_init)
{
    uint32_t reg_val;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* enable CAN FD operation */
    CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_FDOE;
    CAN_M_CAN_CCCR(can_periph) &= ~(CAN_M_CAN_CCCR_NISO | CAN_M_CAN_CCCR_BRSE);

    /* enable/disable ISO CAN FD protocol */
    if(DISABLE == can_fd_para_init->iso_can_fd_enable) {
        /* non-ISO CAN FD */
        CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_NISO;
    }

    /* enable/disable bit rate switching */
    if(DISABLE != can_fd_para_init->bitrate_switch_enable) {
        /* enable bit rate switching */
        CAN_M_CAN_CCCR(can_periph) |= CAN_M_CAN_CCCR_BRSE;
    }

    /* configure bit timing parameters for data phase */
    reg_val = CAN_M_CAN_DBTP(can_periph);
    reg_val &= ~(CAN_M_CAN_DBTP_DSJW | CAN_M_CAN_DBTP_DTSEG2 | CAN_M_CAN_DBTP_DTSEG1 | CAN_M_CAN_DBTP_DBRP | CAN_M_CAN_DBTP_TDC);
    reg_val |= (DBTP_DSJW(can_fd_para_init->resync_jump_width - 1U) | \
                DBTP_DTSEG2(can_fd_para_init->time_segment_2 - 1U) | \
                DBTP_DTSEG1(can_fd_para_init->time_segment_1 - 1U) | \
                DBTP_DBRP(can_fd_para_init->prescaler - 1U));

    /* configure transmitter delay compensation */
    if(DISABLE != can_fd_para_init->tdc_enable) {
        /* enable transmitter delay compensation */
        reg_val |= CAN_M_CAN_DBTP_TDC;

        CAN_M_CAN_TDCR(can_periph) &= ~(CAN_M_CAN_TDCR_TDCO | CAN_M_CAN_TDCR_TDCF);
        /* configure transmitter delay compensation offset */
        CAN_M_CAN_TDCR(can_periph) |= TDCR_TDCO((uint32_t)can_fd_para_init->tdc_offset);
        /* configure transmitter delay compensation filter window */
        CAN_M_CAN_TDCR(can_periph) |= TDCR_TDCF((uint32_t)can_fd_para_init->tdc_filter_window);
    }

    CAN_M_CAN_DBTP(can_periph) = reg_val;
}

/*!
    \brief      disable CAN FD mode (API_ID(0x000EU))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_fd_disable(can_dtm_canx_enum dtm_canx)
{
    /* disable CAN FD operation */
    CAN_M_CAN_CCCR((uint32_t)dtm_canx) &= ~CAN_M_CAN_CCCR_FDOE;
}

/*!
    \brief      get transmitter delay compensation value (API_ID(0x000FU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     0~127
*/
uint16_t can_tdc_get(can_dtm_canx_enum dtm_canx)
{
    return CAN_M_CAN_PSR_HIGH((uint32_t)dtm_canx) & CAN_TDCV_MASK;
}

/*!
    \brief      configure transmitter delay compensation (API_ID(0x0010U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  enable
      \arg        ENABLE
      \arg        DISABLE
    \param[in]  offset: transmitter delay compensation offset
      \arg        0~0x7F
    \param[in]  filter_window: transmitter delay compensation filter window
      \arg        0~0x7F
    \param[out] none
    \retval     none
*/
void can_tdc_config(can_dtm_canx_enum dtm_canx, ControlStatus enable, uint8_t offset, uint8_t filter_window)
{
    uint32_t can_periph = (uint32_t)dtm_canx;
    if(ENABLE == enable) {
        /* enable transmitter delay compensation */
        CAN_M_CAN_DBTP(can_periph) |= CAN_M_CAN_DBTP_TDC;

        CAN_M_CAN_TDCR(can_periph) &= ~(CAN_M_CAN_TDCR_TDCO | CAN_M_CAN_TDCR_TDCF);
        /* configure transmitter delay compensation offset */
        CAN_M_CAN_TDCR(can_periph) |= TDCR_TDCO((uint32_t)offset);
        /* configure transmitter delay compensation filter window */
        CAN_M_CAN_TDCR(can_periph) |= TDCR_TDCF((uint32_t)filter_window);
    } else {
        /* disable transmitter delay compensation */
        CAN_M_CAN_DBTP(can_periph) &= ~CAN_M_CAN_DBTP_TDC;
    }
}

/*!
    \brief      enable edge filtering during bus integration (API_ID(0x0011U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_edge_filtering_enable(can_dtm_canx_enum dtm_canx)
{
    /* enable edge filtering during bus integration */
    CAN_M_CAN_CCCR((uint32_t)dtm_canx) |= CAN_M_CAN_CCCR_EFBI;
}

/*!
    \brief      disable edge filtering during bus integration (API_ID(0x0012U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_edge_filtering_disable(can_dtm_canx_enum dtm_canx)
{
    /* disable edge filtering during bus integration */
    CAN_M_CAN_CCCR((uint32_t)dtm_canx) &= ~CAN_M_CAN_CCCR_EFBI;
}

/*!
    \brief      enable protocol exception handling (API_ID(0x0013U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_protocol_exception_enable(can_dtm_canx_enum dtm_canx)
{
    /* enable protocol exception handling */
    CAN_M_CAN_CCCR((uint32_t)dtm_canx) &= ~CAN_M_CAN_CCCR_PXHD;
}

/*!
    \brief      disable protocol exception handling (API_ID(0x0014U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_protocol_exception_disable(can_dtm_canx_enum dtm_canx)
{
    /* disable protocol exception handling */
    CAN_M_CAN_CCCR((uint32_t)dtm_canx) |= CAN_M_CAN_CCCR_PXHD;
}

/*!
    \brief      enable 'disable modification on read' function for DTM_CAN (API_ID(0x0015U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_dismodify_on_read_enable(can_dtm_canx_enum dtm_canx)
{
    /* determine which DTM_CAN is selected */
    switch(dtm_canx) {
    case DTM_CAN0:
        CAN_DMR(CAN0) |= CAN_DMR_DMORD0;
        break;
    case DTM_CAN1:
        CAN_DMR(CAN0) |= CAN_DMR_DMORD1;
        break;
    case DTM_CAN2:
        CAN_DMR(CAN1) |= CAN_DMR_DMORD0;
        break;
    case DTM_CAN3:
        CAN_DMR(CAN1) |= CAN_DMR_DMORD1;
        break;
    case DTM_CAN4:
        CAN_DMR(CAN1) |= CAN_DMR_DMORD2;
        break;
    case DTM_CAN5:
        CAN_DMR(CAN2) |= CAN_DMR_DMORD0;
        break;
    case DTM_CAN6:
        CAN_DMR(CAN2) |= CAN_DMR_DMORD1;
        break;
    case DTM_CAN7:
        CAN_DMR(CAN2) |= CAN_DMR_DMORD2;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable 'disable modification on read' function for DTM_CAN (API_ID(0x0016U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_dismodify_on_read_disable(can_dtm_canx_enum dtm_canx)
{
    /* determine which DTM_CAN is selected */
    switch(dtm_canx) {
    case DTM_CAN0:
        CAN_DMR(CAN0) &= ~CAN_DMR_DMORD0;
        break;
    case DTM_CAN1:
        CAN_DMR(CAN0) &= ~CAN_DMR_DMORD1;
        break;
    case DTM_CAN2:
        CAN_DMR(CAN1) &= ~CAN_DMR_DMORD0;
        break;
    case DTM_CAN3:
        CAN_DMR(CAN1) &= ~CAN_DMR_DMORD1;
        break;
    case DTM_CAN4:
        CAN_DMR(CAN1) &= ~CAN_DMR_DMORD2;
        break;
    case DTM_CAN5:
        CAN_DMR(CAN2) &= ~CAN_DMR_DMORD0;
        break;
    case DTM_CAN6:
        CAN_DMR(CAN2) &= ~CAN_DMR_DMORD1;
        break;
    case DTM_CAN7:
        CAN_DMR(CAN2) &= ~CAN_DMR_DMORD2;
        break;
    default:
        break;
    }
}

/*!
    \brief      enable clock stop request for DTM_CAN (API_ID(0x0017U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_clock_stop_request_enable(can_dtm_canx_enum dtm_canx)
{
    /* determine which DTM_CAN is selected */
    switch(dtm_canx) {
    case DTM_CAN0:
        CAN_CSR(CAN0) |= CAN_CSR_CSR0;
        break;
    case DTM_CAN1:
        CAN_CSR(CAN0) |= CAN_CSR_CSR1;
        break;
    case DTM_CAN2:
        CAN_CSR(CAN1) |= CAN_CSR_CSR0;
        break;
    case DTM_CAN3:
        CAN_CSR(CAN1) |= CAN_CSR_CSR1;
        break;
    case DTM_CAN4:
        CAN_CSR(CAN1) |= CAN_CSR_CSR2;
        break;
    case DTM_CAN5:
        CAN_CSR(CAN2) |= CAN_CSR_CSR0;
        break;
    case DTM_CAN6:
        CAN_CSR(CAN2) |= CAN_CSR_CSR1;
        break;
    case DTM_CAN7:
        CAN_CSR(CAN2) |= CAN_CSR_CSR2;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable clock stop request for DTM_CAN (API_ID(0x0018U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_clock_stop_request_disable(can_dtm_canx_enum dtm_canx)
{
    /* determine which DTM_CAN is selected */
    switch(dtm_canx) {
    case DTM_CAN0:
        CAN_CSR(CAN0) &= ~CAN_CSR_CSR0;
        break;
    case DTM_CAN1:
        CAN_CSR(CAN0) &= ~CAN_CSR_CSR1;
        break;
    case DTM_CAN2:
        CAN_CSR(CAN1) &= ~CAN_CSR_CSR0;
        break;
    case DTM_CAN3:
        CAN_CSR(CAN1) &= ~CAN_CSR_CSR1;
        break;
    case DTM_CAN4:
        CAN_CSR(CAN1) &= ~CAN_CSR_CSR2;
        break;
    case DTM_CAN5:
        CAN_CSR(CAN2) &= ~CAN_CSR_CSR0;
        break;
    case DTM_CAN6:
        CAN_CSR(CAN2) &= ~CAN_CSR_CSR1;
        break;
    case DTM_CAN7:
        CAN_CSR(CAN2) &= ~CAN_CSR_CSR2;
        break;
    default:
        break;
    }
}

/*!
    \brief      get clock stop acknowledge for DTM_CAN (API_ID(0x0019U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_clock_stop_acknowledge_get(can_dtm_canx_enum dtm_canx)
{
    FlagStatus ret = RESET;
    uint32_t flag = 0U;

