sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    /* determine which DTM_CAN is selected */
    switch(dtm_canx) {
    case DTM_CAN0:
        /* get clock stop acknowledge for DTM_CAN0 */
        flag = CAN_CSA(CAN0) & CAN_CSA_CSA0;
        break;
    case DTM_CAN1:
        /* get clock stop acknowledge for DTM_CAN1 */
        flag = CAN_CSA(CAN0) & CAN_CSA_CSA1;
        break;
    case DTM_CAN2:
        /* get clock stop acknowledge for DTM_CAN2 */
        flag = CAN_CSA(CAN1) & CAN_CSA_CSA0;
        break;
    case DTM_CAN3:
        /* get clock stop acknowledge for DTM_CAN3 */
        flag = CAN_CSA(CAN1) & CAN_CSA_CSA1;
        break;
    case DTM_CAN4:
        /* get clock stop acknowledge for DTM_CAN4 */
        flag = CAN_CSA(CAN1) & CAN_CSA_CSA2;
        break;
    case DTM_CAN5:
        /* get clock stop acknowledge for DTM_CAN5 */
        flag = CAN_CSA(CAN2) & CAN_CSA_CSA0;
        break;
    case DTM_CAN6:
        /* get clock stop acknowledge for DTM_CAN6 */
        flag = CAN_CSA(CAN2) & CAN_CSA_CSA1;
        break;
    case DTM_CAN7:
        /* get clock stop acknowledge for DTM_CAN7 */
        flag = CAN_CSA(CAN2) & CAN_CSA_CSA2;
        break;
    default:
        break;
    }

    if(0U != flag) {
        ret = SET;
    }
    return ret;
}

/*!
    \brief      enable DMA request for DTM_CAN (API_ID(0x001AU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_dma_request_enable(can_dtm_canx_enum dtm_canx)
{
    /* determine which DTM_CAN is selected */
    switch(dtm_canx) {
    case DTM_CAN0:
        CAN_CTL(CAN0) |= CAN_CTL_DMAEN0;
        break;
    case DTM_CAN1:
        CAN_CTL(CAN0) |= CAN_CTL_DMAEN1;
        break;
    case DTM_CAN2:
        CAN_CTL(CAN1) |= CAN_CTL_DMAEN0;
        break;
    case DTM_CAN3:
        CAN_CTL(CAN1) |= CAN_CTL_DMAEN1;
        break;
    case DTM_CAN4:
        CAN_CTL(CAN1) |= CAN_CTL_DMAEN2;
        break;
    case DTM_CAN5:
        CAN_CTL(CAN2) |= CAN_CTL_DMAEN0;
        break;
    case DTM_CAN6:
        CAN_CTL(CAN2) |= CAN_CTL_DMAEN1;
        break;
    case DTM_CAN7:
        CAN_CTL(CAN2) |= CAN_CTL_DMAEN2;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable DMA request for DTM_CAN (API_ID(0x001BU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_dma_request_disable(can_dtm_canx_enum dtm_canx)
{
    /* determine which DTM_CAN is selected */
    switch(dtm_canx) {
    case DTM_CAN0:
        CAN_CTL(CAN0) &= ~CAN_CTL_DMAEN0;
        break;
    case DTM_CAN1:
        CAN_CTL(CAN0) &= ~CAN_CTL_DMAEN1;
        break;
    case DTM_CAN2:
        CAN_CTL(CAN1) &= ~CAN_CTL_DMAEN0;
        break;
    case DTM_CAN3:
        CAN_CTL(CAN1) &= ~CAN_CTL_DMAEN1;
        break;
    case DTM_CAN4:
        CAN_CTL(CAN1) &= ~CAN_CTL_DMAEN2;
        break;
    case DTM_CAN5:
        CAN_CTL(CAN2) &= ~CAN_CTL_DMAEN0;
        break;
    case DTM_CAN6:
        CAN_CTL(CAN2) &= ~CAN_CTL_DMAEN1;
        break;
    case DTM_CAN7:
        CAN_CTL(CAN2) &= ~CAN_CTL_DMAEN2;
        break;
    default:
        break;
    }
}

/*!
    \brief      enable CAN_MERRCTL register write access (API_ID(0x001CU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_merrctl_write_access_enable(can_dtm_canx_enum dtm_canx)
{
    uint32_t can_periph;

    /* determine which DTM_CAN is selected */
    can_periph = can_dtm_to_can(dtm_canx);

    /* enable CAN_MERRCTL register write */
    CAN_CTL(can_periph) |= CAN_CTL_ECRWEN;

    /* clear RWDIS bit */
    CAN_MERRCTL(can_periph) &= ~CAN_MERRCTL_RWDIS;
}

/*!
    \brief      disable CAN_MERRCTL register write access (API_ID(0x001DU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_merrctl_write_access_disable(can_dtm_canx_enum dtm_canx)
{
    uint32_t can_periph;

    /* determine which DTM_CAN is selected */
    can_periph = can_dtm_to_can(dtm_canx);

    /* enable CAN_MERRCTL register write */
    CAN_CTL(can_periph) |= CAN_CTL_ECRWEN;

    /* set RWDIS bit */
    CAN_MERRCTL(can_periph) |= CAN_MERRCTL_RWDIS;

    /* disable CAN_MERRCTL register write */
    CAN_CTL(can_periph) &= ~CAN_CTL_ECRWEN;
}

/*!
    \brief      enable error report and error status update (API_ID(0x001EU))
                notice to call can_merrctl_write_access_enable() function as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_ecc_enable(can_dtm_canx_enum dtm_canx)
{
    ErrStatus ret_status = SUCCESS;
    uint32_t can_periph;
    uint32_t ctl, merrctl;

    /* determine which DTM_CAN is selected */
    can_periph = can_dtm_to_can(dtm_canx);
    ctl = CAN_CTL(can_periph);
    merrctl = CAN_MERRCTL(can_periph);

    /* check if CAN_MERRCTL register is write-protected */
    if((0U != (merrctl & CAN_MERRCTL_RWDIS)) || (0U == (ctl & CAN_CTL_ECRWEN))) {
        ret_status = ERROR;
    } else {
        /* enable ECC */
        CAN_MERRCTL(can_periph) |= CAN_MERRCTL_ECCEN;
    }

    return ret_status;
}

/*!
    \brief      disable error report and error status update (API_ID(0x001FU))
                notice to call can_merrctl_write_access_enable() function as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_ecc_disable(can_dtm_canx_enum dtm_canx)
{
    ErrStatus ret_status = SUCCESS;
    uint32_t can_periph;
    uint32_t ctl, merrctl;

    /* determine which DTM_CAN is selected */
    can_periph = can_dtm_to_can(dtm_canx);
    ctl = CAN_CTL(can_periph);
    merrctl = CAN_MERRCTL(can_periph);

    /* check if CAN_MERRCTL register is write-protected */
    if((0U != (merrctl & CAN_MERRCTL_RWDIS)) || (0U == (ctl & CAN_CTL_ECRWEN))) {
        ret_status = ERROR;
    } else {
        /* disable ECC */
        CAN_MERRCTL(can_periph) &= ~CAN_MERRCTL_ECCEN;
    }

    return ret_status;
}

/*!
    \brief      get memory error status (API_ID(0x0020U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  index: memory error index
                only one parameter can be selected which is shown as below:
      \arg        CAN_MEM_ERR_CORRECTABLE_0: CAN memory error correctable 0
      \arg        CAN_MEM_ERR_CORRECTABLE_1: CAN memory error correctable 1
      \arg        CAN_MEM_ERR_CORRECTABLE_2: CAN memory error correctable 2
      \arg        CAN_MEM_ERR_CORRECTABLE_3: CAN memory error correctable 3
      \arg        CAN_MEM_ERR_NONCORRECTABLE: CAN memory error noncorrectable
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_memory_error_status_get(can_dtm_canx_enum dtm_canx, can_memory_error_index_enum index)
{
    FlagStatus flag = RESET;
    uint32_t can_periph;

