sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    /* determine which DTM_CAN is selected */
    can_periph = can_dtm_to_can(dtm_canx);

    if(index == CAN_MEM_ERR_NONCORRECTABLE) {
        if(0U != (CAN_NCERRR(can_periph) & CAN_NCERRR_NCERS)) {
            flag = SET;
        }
    } else {
        if(0U != (CAN_CERRR(can_periph, (uint32_t)index) & CAN_CERRR_CERS)) {
            flag = SET;
        }
    }

    return flag;
}

/*!
    \brief      get memory error address (API_ID(0x0021U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  index: memory error index
                only one parameter can be selected which is shown as below:
      \arg        CAN_MEM_ERR_CORRECTABLE_0: CAN memory error correctable 0
      \arg        CAN_MEM_ERR_CORRECTABLE_1: CAN memory error correctable 1
      \arg        CAN_MEM_ERR_CORRECTABLE_2: CAN memory error correctable 2
      \arg        CAN_MEM_ERR_CORRECTABLE_3: CAN memory error correctable 3
      \arg        CAN_MEM_ERR_NONCORRECTABLE: CAN memory error noncorrectable
    \param[out] none
    \retval     memory error address
*/
uint32_t can_memory_error_address_get(can_dtm_canx_enum dtm_canx, can_memory_error_index_enum index)
{
    uint32_t ret;
    uint32_t can_periph;

    /* determine which DTM_CAN is selected */
    can_periph = can_dtm_to_can(dtm_canx);

    /* get memory error address */
    if(index == CAN_MEM_ERR_NONCORRECTABLE) {
        ret = GET_NCERRR_NCERA(CAN_NCERRR(can_periph));
    } else {
        ret = GET_CERRR_CERA(CAN_CERRR(can_periph, (uint32_t)index));
    }

    return ret;
}

/*!
    \brief      clear CAN_CERRR0 - CAN_CERRR3, and CAN_NCERRR register record (API_ID(0x0022U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_memory_error_record_clear(can_dtm_canx_enum dtm_canx)
{
    uint32_t can_periph;

    /* determine which DTM_CAN is selected */
    can_periph = can_dtm_to_can(dtm_canx);

    /* enable CAN_MERRCTL register write */
    CAN_CTL(can_periph) |= CAN_CTL_ECRWEN;
    /* clear RWDIS bit */
    CAN_MERRCTL(can_periph) &= ~CAN_MERRCTL_RWDIS;

    /* disable ECC to clear memory error records */
    CAN_MERRCTL(can_periph) &= ~CAN_MERRCTL_ECCEN;

    /* enable ECC again */
    CAN_MERRCTL(can_periph) |= CAN_MERRCTL_ECCEN;
}


/*!
    \brief      configure the message RAM watchdog counter (API_ID(0x0023U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  counter: message RAM watchdog counter start value
      \arg        0~255
    \param[out] none
    \retval     none
*/
void can_sram_watchdog_config(uint32_t dtm_canx, uint8_t counter)
{
    /* configure watchdog counter */
    CAN_M_CAN_RWD(dtm_canx) &= ~CAN_M_CAN_RWD_WDC;
    CAN_M_CAN_RWD(dtm_canx) |= (uint32_t)counter & CAN_M_CAN_RWD_WDC;
}

/*!
    \brief      get message RAM watchdog counter value (API_ID(0x0024U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     0~255
*/
uint8_t can_sram_watchdog_counter_get(uint32_t dtm_canx)
{
    return (uint8_t)((CAN_M_CAN_RWD(dtm_canx) & CAN_M_CAN_RWD_WDV) >> CAN_M_CAN_RWD_WDV_OFFSET);
}

/*!
    \brief      timeout configuration (API_ID(0x0025U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  prescaler: timestamp and timeout counter prescaler
      \arg        1~16
    \param[out] none
    \retval     none
*/
void can_timestamp_timeout_prescaler_config(can_dtm_canx_enum dtm_canx, uint16_t prescaler)
{
    uint32_t temp;

    /* configure timestamp and timeout prescaler */
    temp = CAN_M_CAN_TSCC((uint32_t)dtm_canx);
    temp &= ~CAN_M_CAN_TSCC_TCP;
    temp |= TSCC_TCP((uint32_t)prescaler - 1U);
    CAN_M_CAN_TSCC((uint32_t)dtm_canx) = temp;
}

/*!
    \brief      enable CAN timestamp (API_ID(0x0026U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_timestamp_enable(can_dtm_canx_enum dtm_canx)
{
    uint32_t temp;

    /* enable timestamp */
    temp = CAN_M_CAN_TSCC((uint32_t)dtm_canx);
    temp &= ~CAN_M_CAN_TSCC_TSS;
    temp |= CAN_TS_INTERNAL;
    CAN_M_CAN_TSCC((uint32_t)dtm_canx) = temp;
}

/*!
    \brief      disable CAN timestamp (API_ID(0x0027U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_timestamp_disable(can_dtm_canx_enum dtm_canx)
{
    uint32_t temp;

    /* disable timestamp */
    temp = CAN_M_CAN_TSCC((uint32_t)dtm_canx);
    temp &= ~CAN_M_CAN_TSCC_TSS;
    temp |= CAN_TS_DISABLE;
    CAN_M_CAN_TSCC((uint32_t)dtm_canx) = temp;
}

/*!
    \brief      reset CAN timestamp counter value (API_ID(0x0028U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_timestamp_reset(can_dtm_canx_enum dtm_canx)
{
    CAN_M_CAN_TSCV((uint32_t)dtm_canx) = 0U;
}

/*!
    \brief      enable timeout counter (API_ID(0x0029U))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  timeout_mode: timeout counter operating mode
                only one parameter can be selected which is shown as below:
      \arg        CAN_TIMEOUT_CONTINUOUS: continuous operation
      \arg        CAN_TIMEOUT_TXFIFO: controlled by Tx event FIFO
      \arg        CAN_TIMEOUT_RXFIFO0: controlled by Rx FIFO 0
      \arg        CAN_TIMEOUT_RXFIFO1: controlled by Rx FIFO 1
    \param[in]  timeout_period: timeout period
      \arg        0~0xFFFF
    \param[out] none
    \retval     none
*/
void can_timeout_enable(can_dtm_canx_enum dtm_canx, can_timeout_mode_enum timeout_mode, uint16_t timeout_period)
{
    uint32_t temp;

    /* configure timeout counter */
    temp = CAN_M_CAN_TOCC((uint32_t)dtm_canx);
    temp &= ~(CAN_M_CAN_TOCC_TOS | CAN_M_CAN_TOCC_TOP);
    temp |= (CAN_M_CAN_TOCC_ETOC | TOCC_TOS((uint32_t)timeout_mode) | TOCC_TOP(timeout_period));
    CAN_M_CAN_TOCC((uint32_t)dtm_canx) = temp;
}

/*!
    \brief      disable timeout counter (API_ID(0x002AU))
                notice to enter CAN_MODE_INIT mode as condition
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_timeout_disable(can_dtm_canx_enum dtm_canx)
{
    /* disable timeout counter */
    CAN_M_CAN_TOCC((uint32_t)dtm_canx) &= ~CAN_M_CAN_TOCC_ETOC;
}

/*!
    \brief      get timeout counter value (API_ID(0x002BU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     0~0xFFFF
*/
uint16_t can_timeout_value_get(can_dtm_canx_enum dtm_canx)
{
    /* get timeout counter value */
    return ((uint16_t)(CAN_M_CAN_TOCV((uint32_t)dtm_canx) & CAN_M_CAN_TOCV_TOC));
}

/*!
    \brief      restart CAN timeout counter value (API_ID(0x002CU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_timeout_restart(can_dtm_canx_enum dtm_canx)
{
    CAN_M_CAN_TOCV((uint32_t)dtm_canx) = 0U;
}

/*!
    \brief      get Tx FIFO / Tx queue free level (API_ID(0x002DU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     0~32
*/
uint8_t can_tx_fifo_free_level_get(can_dtm_canx_enum dtm_canx)
{
    /* get Tx FIFO free level */
    return (uint8_t)(CAN_M_CAN_TXFQS((uint32_t)dtm_canx) & CAN_M_CAN_TXFQS_TFFL);
}

/*!
    \brief      get Tx FIFO / Tx event FIFO / Rx FIFO get index (API_ID(0x002EU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  fifo_type: FIFO type
                only one parameter can be selected which is shown as below:
      \arg        CAN_FIFO_TX: Tx FIFO
      \arg        CAN_FIFO_RX0: Rx FIFO 0
      \arg        CAN_FIFO_RX1: Rx FIFO 1
      \arg        CAN_FIFO_TXEVENT: Tx event FIFO
    \param[out] none
    \retval     0~31 or 0~63
*/
uint8_t can_fifo_get_index_get(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type)
{
    uint8_t get_index = 0U;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* get FIFO get index based on FIFO type */
    switch(fifo_type) {
    case CAN_FIFO_TX:
        get_index = (uint8_t)(GET_TXFQS_TFGI(CAN_M_CAN_TXFQS(can_periph)));
        break;
    case CAN_FIFO_RX0:
        get_index = (uint8_t)(GET_RXFXS_FXGI(CAN_M_CAN_RXF0S(can_periph)));
        break;
    case CAN_FIFO_RX1:
        get_index = (uint8_t)(GET_RXFXS_FXGI(CAN_M_CAN_RXF1S(can_periph)));
        break;
    case CAN_FIFO_TXEVENT:
        get_index = (uint8_t)(GET_TXEFS_EFGI(CAN_M_CAN_TXEFS(can_periph)));
        break;
    default:
        break;
    }

