sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    return get_index;
}

/*!
    \brief      get Tx FIFO / Tx queue / Tx event FIFO / Rx FIFO put index (API_ID(0x002FU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  fifo_type: FIFO type
                only one parameter can be selected which is shown as below:
      \arg        CAN_FIFO_TX: Tx FIFO
      \arg        CAN_FIFO_RX0: Rx FIFO 0
      \arg        CAN_FIFO_RX1: Rx FIFO 1
      \arg        CAN_FIFO_TXEVENT: Tx event FIFO
    \param[out] none
    \retval     0~31 or 0~63
*/
uint8_t can_fifo_put_index_get(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type)
{
    uint8_t put_index = 0U;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* get FIFO put index based on FIFO type */
    switch(fifo_type) {
    case CAN_FIFO_TX:
        put_index = (uint8_t)(GET_TXFQS_TFQPI(CAN_M_CAN_TXFQS(can_periph)));
        break;
    case CAN_FIFO_RX0:
        put_index = (uint8_t)(GET_RXFXS_FXPI(CAN_M_CAN_RXF0S(can_periph)));
        break;
    case CAN_FIFO_RX1:
        put_index = (uint8_t)(GET_RXFXS_FXPI(CAN_M_CAN_RXF1S(can_periph)));
        break;
    case CAN_FIFO_TXEVENT:
        put_index = (uint8_t)(GET_TXEFS_EFPI(CAN_M_CAN_TXEFS(can_periph)));
        break;
    default:
        break;
    }

    return put_index;
}

/*!
    \brief      get Tx FIFO / Tx queue / Tx event FIFO / Rx FIFO full state (API_ID(0x0030U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  fifo_type: FIFO type
                only one parameter can be selected which is shown as below:
      \arg        CAN_FIFO_TX: Tx FIFO
      \arg        CAN_FIFO_RX0: Rx FIFO 0
      \arg        CAN_FIFO_RX1: Rx FIFO 1
      \arg        CAN_FIFO_TXEVENT: Tx event FIFO
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_fifo_full_state_get(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type)
{
    uint32_t flag = 0U;
    FlagStatus state = RESET;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* get FIFO full state based on FIFO type */
    switch(fifo_type) {
    case CAN_FIFO_TX:
        flag = CAN_M_CAN_TXFQS(can_periph) & CAN_M_CAN_TXFQS_TFQF;
        break;
    case CAN_FIFO_RX0:
        flag = CAN_M_CAN_RXF0S(can_periph) & CAN_M_CAN_RXFXS_FF;
        break;
    case CAN_FIFO_RX1:
        flag = CAN_M_CAN_RXF1S(can_periph) & CAN_M_CAN_RXFXS_FF;
        break;
    case CAN_FIFO_TXEVENT:
        flag = CAN_M_CAN_TXEFS(can_periph) & CAN_M_CAN_TXEFS_EFF;
        break;
    default:
        break;
    }

    if(0U != flag) {
        state = SET;
    }

    return state;
}

/*!
    \brief      get Tx event FIFO / Rx FIFO fill level (API_ID(0x0031U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  fifo_type: FIFO type
                only one parameter can be selected which is shown as below:
      \arg        CAN_FIFO_RX0: Rx FIFO 0
      \arg        CAN_FIFO_RX1: Rx FIFO 1
      \arg        CAN_FIFO_TXEVENT: Tx event FIFO
    \param[out] none
    \retval     0~32 or 0~64
*/
uint8_t can_fifo_fill_level_get(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type)
{
    uint8_t fill_level = 0U;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* get FIFO fill level based on FIFO type */
    switch(fifo_type) {
    case CAN_FIFO_RX0:
        fill_level = (uint8_t)(CAN_M_CAN_RXF0S(can_periph) & CAN_M_CAN_RXFXS_FFL);
        break;
    case CAN_FIFO_RX1:
        fill_level = (uint8_t)(CAN_M_CAN_RXF1S(can_periph) & CAN_M_CAN_RXFXS_FFL);
        break;
    case CAN_FIFO_TXEVENT:
        fill_level = (uint8_t)(CAN_M_CAN_TXEFS(can_periph) & CAN_M_CAN_TXEFS_EFFL);
        break;
    default:
        break;
    }

    return fill_level;
}

/*!
    \brief      acknowledge Tx event FIFO / Rx FIFO messages (API_ID(0x0032U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  fifo_type: FIFO type
                only one parameter can be selected which is shown as below:
      \arg        CAN_FIFO_RX0: Rx FIFO 0
      \arg        CAN_FIFO_RX1: Rx FIFO 1
      \arg        CAN_FIFO_TXEVENT: Tx event FIFO
    \param[out] none
    \retval     none
*/
void can_fifo_acknowledge(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type)
{
    uint8_t index;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* get FIFO get index */
    index = can_fifo_get_index_get(dtm_canx, fifo_type);

    /* acknowledge FIFO based on FIFO type */
    switch(fifo_type) {
    case CAN_FIFO_RX0:
        CAN_M_CAN_RXF0A(can_periph) = index;
        break;
    case CAN_FIFO_RX1:
        CAN_M_CAN_RXF1A(can_periph) = index;
        break;
    case CAN_FIFO_TXEVENT:
        CAN_M_CAN_TXEFA(can_periph) = index;
        break;
    default:
        break;
    }
}

/*!
    \brief      read a Tx event FIFO element (API_ID(0x0033U))
    \param[in]  dtm_canx: DTM_CANx(x=0,1,2,3,4,5,6,7)
    \param[out] txevent: pointer to Tx event FIFO element structure
    \retval     none
*/
void can_txev_fifo_read(can_dtm_canx_enum dtm_canx, can_txev_fifo_element_struct *txevent)
{
    uint32_t e0, e1;
    uint32_t address;
    uint8_t wmm, index;
    uint32_t event_type;
    uint32_t txev_fifo_saddr, mem_address;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* check if Tx event FIFO is not empty */
    if(0U != (CAN_M_CAN_TXEFS(can_periph) & CAN_M_CAN_TXEFS_EFFL)) {
        /* get Tx event FIFO get index */
        index = (uint8_t)(GET_TXEFS_EFGI(CAN_M_CAN_TXEFS(can_periph)));
        /* get Tx event FIFO element start address */
        txev_fifo_saddr = GET_TXEFC_EFSA(CAN_M_CAN_TXEFC(can_periph)) * 4U;
        /* determine which DTM_CAN is selected */
        mem_address = can_dtm_to_can(dtm_canx);
        /* calculate Tx event FIFO element address */
        address = mem_address + txev_fifo_saddr + ((uint32_t)index * 8U);

        /* check if wide message marker is enabled */
        wmm = (uint8_t)((CAN_M_CAN_CCCR(can_periph) & CAN_M_CAN_CCCR_WMM) >> CAN_M_CAN_CCCR_WMM_OFFSET);

        /* get first word of Tx event FIFO element (E0) */
        e0 = REG32(address);
        /* get second word of Tx event FIFO element (E1A or E1B) */
        address += 4U;
        e1 = REG32(address);

        /* copy R0 and R1 words to message structure */
        txevent->id = e0 & CAN_E0_ID;
        txevent->rtr = (e0 & CAN_E0_RTR) >> CAN_E0_RTR_OFFSET;
        txevent->xtd = (e0 & CAN_E0_RTR) >> CAN_E0_XTD_OFFSET;
        txevent->esi = (e0 & CAN_E0_RTR) >> CAN_E0_ESI_OFFSET;

        /* if is standard identifier */
        if(0U == txevent->xtd) {
            txevent->id >>= 18U;
        }

        txevent->dlc = (uint8_t)((e1 & CAN_E1A_DLC) >> CAN_E1_DLC_OFFSET);
        txevent->brs = (uint8_t)((e1 & CAN_E1A_BRS) >> CAN_E1_BRS_OFFSET);
        txevent->fdf = (uint8_t)((e1 & CAN_E1A_FDF) >> CAN_E1_FDF_OFFSET);

        /* calculate data length based on DLC value */
        if(txevent->fdf == 1U) {
            /* CAN FD frame */
            txevent->data_length = dlc_to_databytes[txevent->dlc];
        } else {
            /* classic CAN frame */
            if(txevent->dlc <= 8U) {
                txevent->data_length = txevent->dlc;
            } else {
                txevent->data_length = 8U;
            }
        }

        /* get event type */
        event_type = (e1 & CAN_E1A_ET) >> CAN_E1_ET_OFFSET;
        if(1U == event_type) {
            txevent->event_type = CAN_TX;
        } else if(2U == event_type) {
            txevent->event_type = CAN_TX_AFTER_CANCEL;
        } else {
            txevent->event_type = CAN_NONE;
        }

        /* get timestamp if available */
        if(0U == wmm) {
            txevent->timestamp = (uint16_t)(e1 & CAN_E1A_TXTS);
            txevent->message_marker = (uint16_t)((e1 & CAN_E1A_MM_LOW) >> CAN_E1_MM_LOW_OFFSET);
        } else {
            txevent->timestamp = 0U;
            txevent->message_marker = (uint16_t)((e1 & CAN_E1B_MM_LOW) >> CAN_E1_MM_LOW_OFFSET);
            txevent->message_marker |= (uint16_t)(e1 & CAN_E1B_MM_HIGH);
        }

        /* update Tx event FIFO get index */
        CAN_M_CAN_TXEFA(can_periph) = index;
    }
}

/*!
    \brief      configure CAN transmission message (API_ID(0x0034U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  transmit_message: CAN transmit message struct
                  id: 0~0x3FF or 0~0x1FFFFFFF
                  rtr: CAN_FT_DATA, CAN_FT_REMOTE
                  xtd: CAN_FF_STANDARD, CAN_FF_EXTENDED
                  esi: 0, 1
                  brs: ENABLE, DISABLE
                  fdf: ENABLE, DISABLE
                  message_marker: 0~0xFFFF
                  ev_fifo_control: CAN_TXEVENT_FIFO_STORE, CAN_TXEVENT_FIFO_DISABLE
                  data: transmit data
                  data_bytes: 0~64
    \param[out] none
    \retval     the Tx buffer index to transmit: 0~31 or 0xFF
*/
uint8_t can_message_transmit_prepare(can_dtm_canx_enum dtm_canx, can_transmit_message_struct *transmit_message)
{
    uint32_t txfqs_reg;
    uint32_t buffer_index = 0x000000FFU;
    uint32_t tx_buffer_start_address;
    uint32_t buffer_element_size;
    uint32_t dedicated_buffer_size;
    uint32_t *buffer_addr;
    uint32_t t0_word = 0U;
    uint32_t t1_word = 0U;
    uint32_t dlc;
    uint8_t i = 0U;
    uint32_t length;
    uint32_t mem_address;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* get Tx FIFO/Queue status */
    txfqs_reg = CAN_M_CAN_TXFQS(can_periph);
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NULL == transmit_message) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0034U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get Tx buffer configuration */
        tx_buffer_start_address = GET_TXBC_TBSA(CAN_M_CAN_TXBC(can_periph)) * 4U;
        dedicated_buffer_size = GET_TXBC_NDTB(CAN_M_CAN_TXBC(can_periph));
        if(dedicated_buffer_size > 0x20U) {
            dedicated_buffer_size = 0x20U;
        }

