sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
        /* get buffer index */
        if(dedicated_buffer_size > 0U) {
            /* use dedicated buffer */
            buffer_index = 0U;
            for(i = 0U; i < dedicated_buffer_size; i++) {
                /* check if buffer is free */
                if(0U == (CAN_M_CAN_TXBRP(can_periph) & ((uint32_t)1U << i))) {
                    buffer_index = (uint32_t)i;
                    break;
                }
            }
        }
        if(((uint32_t)i == dedicated_buffer_size) && (0U != (txfqs_reg & CAN_M_CAN_TXFQS_TFQF))) {
            /* Tx buffer is full */
            buffer_index = 0xFFU;
        } else {
            if(((uint32_t)i == dedicated_buffer_size) && (0U == (txfqs_reg & CAN_M_CAN_TXFQS_TFQF))) {
                /* no free dedicated buffer, use queue/FIFO */
                buffer_index = GET_TXFQS_TFQPI(txfqs_reg);
            }
            /* determine which DTM_CAN is selected */
            mem_address = can_dtm_to_can(dtm_canx);
            /* get element size */
            buffer_element_size = GET_TXESC_TBDS(CAN_M_CAN_TXESC(can_periph));
            /* calculate buffer address */
            buffer_addr = (uint32_t *)(mem_address + tx_buffer_start_address + (buffer_index * fifo_element_sz[buffer_element_size]));

            /* prepare T0 word */
            if(CAN_FF_EXTENDED == transmit_message->xtd) {
                /* extended ID */
                t0_word |= (transmit_message->id & CAN_ID_EXT_MASK) | CAN_T0_XTD;
            } else {
                /* standard ID */
                t0_word |= ((transmit_message->id & CAN_ID_STD_MASK) << CAN_ID_STD_OFFSET);
            }
            /* remote frame */
            if(CAN_FT_REMOTE == transmit_message->rtr) {
                t0_word |= CAN_T0_RTR;
            }
            /* error state indicator */
            if(1U == transmit_message->esi) {
                t0_word |= CAN_T0_ESI;
            }

            /* prepare T1 word */
            dlc = can_dlc_value_compute(transmit_message->data_bytes);
            t1_word |= E1A_DLC(dlc);
            /* FD control */
            if(DISABLE != transmit_message->fdf) {
                t1_word |= CAN_T1_FDF;
                if(DISABLE != transmit_message->brs) {
                    t1_word |= CAN_T1_BRS;
                }
            }
            /* event FIFO control */
            if(CAN_TXEVENT_FIFO_STORE == transmit_message->ev_fifo_control) {
                t1_word |= CAN_T1_EFC;
            }
            /* message marker */
            t1_word |= (((uint32_t)transmit_message->message_marker >> 8U) & 0xFFU) << TX_MM_HIGH_OFFSET;
            t1_word |= (((uint32_t)transmit_message->message_marker & 0xFFU)) << TX_MM_LOW_OFFSET;

            /* write T0 and T1 words to buffer */
            *buffer_addr = t0_word;
            buffer_addr++;
            *buffer_addr = t1_word;
            buffer_addr++;

            /* write data bytes */
            length = fifo_element_sz[buffer_element_size];
            if(transmit_message->data_bytes < length) {
                length = transmit_message->data_bytes;
            }
            can_data_write((uint32_t *)buffer_addr, (uint8_t *)(transmit_message->data), length);
        }
    }
    return (uint8_t)buffer_index;
}

/*!
    \brief      add an transmission request (API_ID(0x0035U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  tx_buffer: tx buffer index
      \arg        0-31
    \param[out] none
    \retval     none
*/
void can_message_transmit_add(can_dtm_canx_enum dtm_canx, uint8_t tx_buffer)
{
    uint32_t can_periph = (uint32_t)dtm_canx;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(tx_buffer > 31U) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0035U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* add transmission request */
        CAN_M_CAN_TXBAR(can_periph) |= ((uint32_t)1U << tx_buffer);
    }
}

/*!
    \brief      cancel an transmission request (API_ID(0x0036U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  tx_buffer: tx buffer index
      \arg        0-31
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_message_transmit_cancel(can_dtm_canx_enum dtm_canx, uint8_t tx_buffer)
{
    uint32_t timeout = CAN_TIMEOUT_COUNT;
    ErrStatus ret = SUCCESS;
    uint32_t can_periph = (uint32_t)dtm_canx;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(tx_buffer > 31U) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0036U), ERR_PARAM_OUT_OF_RANGE);
        ret = ERROR;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* request cancellation */
        CAN_M_CAN_TXBCR(can_periph) |= ((uint32_t)1U << tx_buffer);

        /* wait for cancellation to complete */
        while(((CAN_M_CAN_TXBCF(can_periph) & ((uint32_t)1U << tx_buffer)) == 0U) && (timeout > 0U)) {
            timeout--;
        }

        if((CAN_M_CAN_TXBCF(can_periph) & ((uint32_t)1U << tx_buffer)) == 0U) {
            /* cancellation failed */
            ret = ERROR;
        }
    }
    return ret;
}

/*!
    \brief      get an transmission status (API_ID(0x0037U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  tx_buffer: tx buffer index
      \arg        0-31
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_message_transmit_status_get(can_dtm_canx_enum dtm_canx, uint8_t tx_buffer)
{
    FlagStatus ret = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(tx_buffer > 31U) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0037U), ERR_PARAM_OUT_OF_RANGE);
        ret = RESET;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* transmission occurred */
        if(0U != (CAN_M_CAN_TXBTO((uint32_t)dtm_canx) & ((uint32_t)1U << tx_buffer))) {
            ret = SET;
        }
    }
    return ret;
}

/*!
    \brief      get an transmission pending status (API_ID(0x0038U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  tx_buffer: tx buffer index
      \arg        0-31
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_message_transmit_pending_status_get(can_dtm_canx_enum dtm_canx, uint8_t tx_buffer)
{
    FlagStatus ret = RESET;

