sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(tx_buffer > 31U) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0038U), ERR_PARAM_OUT_OF_RANGE);
        ret = RESET;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* transmission request pending */
        if(0U != (CAN_M_CAN_TXBRP((uint32_t)dtm_canx) & ((uint32_t)1U << tx_buffer))) {
            ret = SET;
        }
    }
    return ret;
}

/*!
    \brief      pack CAN transmission message for DMU Tx transmission (API_ID(0x0039U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  transmit_message: CAN transmit message struct
                  id: 0~0x3FF or 0~0x1FFFFFFF
                  rtr: CAN_FT_DATA, CAN_FT_REMOTE
                  xtd: CAN_FF_STANDARD, CAN_FF_EXTENDED
                  esi: 0, 1
                  brs: ENABLE, DISABLE
                  fdf: ENABLE, DISABLE
                  message_marker: 0~0xFFFF
                  ev_fifo_control: CAN_TXEVENT_FIFO_STORE, CAN_TXEVENT_FIFO_DISABLE
                  data: transmit data
                  data_bytes: 0~64
    \param[in]  array_size: array size of dmu_tx[]
    \param[out] dmu_tx: pointer to the array for transmission
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_dmu_message_transmit_prepare(can_dtm_canx_enum dtm_canx, can_transmit_message_struct *transmit_message, uint32_t dmu_tx[],
        uint32_t array_size)
{
    uint32_t *buffer_addr = dmu_tx;
    uint32_t t0_word = 0U;
    uint32_t t1_word = 0U;
    uint32_t dlc;
    uint32_t buffer_element_size, length;
    uint32_t can_periph = (uint32_t)dtm_canx;
    ErrStatus ret;

    /* get element size */
    buffer_element_size = GET_TXESC_TBDS(CAN_M_CAN_TXESC(can_periph));
    length = fifo_element_sz[buffer_element_size];
#ifdef FW_DEBUG_ERR_REPORT
    ret = ERROR;
    /* check parameter */
    if(NULL == transmit_message) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0039U), ERR_PARAM_POINTER);
    } else if((array_size * 4) < length) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0039U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* prepare T0 word */
        if(CAN_FF_EXTENDED == transmit_message->xtd) {
            /* extended ID */
            t0_word |= (transmit_message->id & CAN_ID_EXT_MASK) | CAN_T0_XTD;
        } else {
            /* standard ID */
            t0_word |= ((transmit_message->id & CAN_ID_STD_MASK) << CAN_ID_STD_OFFSET);
        }
        /* remote frame */
        if(CAN_FT_REMOTE == transmit_message->rtr) {
            t0_word |= CAN_T0_RTR;
        }
        /* error state indicator */
        if(1U == transmit_message->esi) {
            t0_word |= CAN_T0_ESI;
        }

        /* prepare T1 word */
        dlc = can_dlc_value_compute(transmit_message->data_bytes);
        t1_word |= E1A_DLC(dlc);
        /* FD control */
        if(DISABLE != transmit_message->fdf) {
            t1_word |= CAN_T1_FDF;
            if(DISABLE != transmit_message->brs) {
                t1_word |= CAN_T1_BRS;
            }
        }
        /* event FIFO control */
        if(CAN_TXEVENT_FIFO_STORE == transmit_message->ev_fifo_control) {
            t1_word |= CAN_T1_EFC;
        }
        /* message marker */
        t1_word |= (((uint32_t)transmit_message->message_marker >> 8U) & 0xFFU) << TX_MM_HIGH_OFFSET;
        t1_word |= (((uint32_t)transmit_message->message_marker & 0xFFU)) << TX_MM_LOW_OFFSET;

        /* write T0 and T1 words to buffer */
        *buffer_addr = t0_word;
        buffer_addr++;
        *buffer_addr = t1_word;
        buffer_addr++;

        /* write data bytes */
        if(transmit_message->data_bytes < length) {
            length = transmit_message->data_bytes;
        }
        can_data_write((uint32_t *)buffer_addr, (uint8_t *)(transmit_message->data), length);
        ret = SUCCESS;
    }
    return ret;
}

/*!
    \brief      release Rx buffer (API_ID(0x003AU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  buffer_index: buffer index
      \arg        0-63
    \param[out] none
    \retval     none
*/
void can_rx_buffer_release(can_dtm_canx_enum dtm_canx, uint8_t buffer_index)
{
    /* check input parameters */
    if(buffer_index > 63U) {
        return;
    }

    /* release Rx buffer by clearing New Data flag */
    if(buffer_index < 32U) {
        CAN_M_CAN_NDAT1((uint32_t)dtm_canx) = ((uint32_t)1U << buffer_index);
    } else {
        CAN_M_CAN_NDAT2((uint32_t)dtm_canx) = ((uint32_t)1U << (buffer_index - 32U));
    }
}

/*!
    \brief      get CAN receive message (API_ID(0x003BU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  storage_type: where the message is stored
                only one parameter can be selected which is shown as below:
      \arg        CAN_RXFIFO0: Rx FIFO 0
      \arg        CAN_RXFIFO1: Rx FIFO 1
      \arg        CAN_RXBUFFER: Rx buffer
    \param[out] receive_message: receive message pointer
    \retval     none
*/
void can_message_receive(can_dtm_canx_enum dtm_canx, can_storage_type_enum storage_type, can_receive_message_struct *receive_message)
{
    uint32_t rx_buffer_start_address;
    uint32_t element_size;
    uint32_t buffer_addr = 0U;
    uint32_t i, j;
    uint32_t index = 0U;
    uint32_t fill_level = 0U;
    uint32_t mem_address;
    can_receive_message_struct temp_message;
    uint32_t can_periph = (uint32_t)dtm_canx;

    /* get FIFO/buffer fill level */
    switch(storage_type) {
    case CAN_RXFIFO0:
        fill_level = CAN_M_CAN_RXF0S(can_periph) & CAN_M_CAN_RXFXS_FFL;
        break;
    case CAN_RXFIFO1:
        fill_level = CAN_M_CAN_RXF1S(can_periph) & CAN_M_CAN_RXFXS_FFL;
        break;
    case CAN_RXBUFFER:
        fill_level = CAN_M_CAN_NDAT1(can_periph);
        fill_level |= CAN_M_CAN_NDAT2(can_periph);
        break;
    default:
        break;
    }

    /* check input parameters */
    if((NULL != receive_message) && (0U != fill_level)) {
        /* determine which DTM_CAN is selected */
        mem_address = can_dtm_to_can(dtm_canx);
        /* get buffer address based on storage type */
        switch(storage_type) {
        case CAN_RXFIFO0:
            rx_buffer_start_address = GET_RXFXC_FSA(CAN_M_CAN_RXF0C(can_periph)) * 4U;
            element_size = GET_RXESC_F0DS(CAN_M_CAN_RXESC(can_periph));
            index = GET_RXFXS_FXGI(CAN_M_CAN_RXF0S(can_periph));
            buffer_addr = mem_address + rx_buffer_start_address + (index * fifo_element_sz[element_size]);
            break;
        case CAN_RXFIFO1:
            rx_buffer_start_address = GET_RXFXC_FSA(CAN_M_CAN_RXF1C(can_periph)) * 4U;
            element_size = GET_RXESC_F1DS(CAN_M_CAN_RXESC(can_periph));
            index = GET_RXFXS_FXGI(CAN_M_CAN_RXF1S(can_periph));
            buffer_addr = mem_address + rx_buffer_start_address + (index * fifo_element_sz[element_size]);
            break;
        case CAN_RXBUFFER:
            rx_buffer_start_address = GET_RXBC_RBSA(CAN_M_CAN_RXBC(can_periph)) * 4U;
            element_size = GET_RXESC_RBDS(CAN_M_CAN_RXESC(can_periph));
            for(i = 0U; i < 32U; i++) {
                /* check if buffer is updated */
                if(0U != (CAN_M_CAN_NDAT1(can_periph) & ((uint32_t)1U << i))) {
                    index = i;
                    break;
                }
            }
            if(32U == i) {
                for(j = 0U; j < 32U; j++) {
                    /* check if buffer is updated */
                    if(0U != (CAN_M_CAN_NDAT2(can_periph) & ((uint32_t)1U << j))) {
                        index = j + 32U;
                        break;
                    }
                }
            }
            buffer_addr = mem_address + rx_buffer_start_address + (index * fifo_element_sz[element_size]);
            break;
        default:
            break;
        }

        can_struct_para_init(CAN_RX_MESSAGE_STRUCT, &temp_message);
        /* receive message from the calculated address */
        temp_message = can_receive_by_addr(buffer_addr);
        /* copy received message to output structure */
        *receive_message = temp_message;

        /* acknowledge FIFO or release Rx buffer */
        switch(storage_type) {
        case CAN_RXFIFO0:
            CAN_M_CAN_RXF0A(can_periph) = index;
            break;
        case CAN_RXFIFO1:
            CAN_M_CAN_RXF1A(can_periph) = index;
            break;
        case CAN_RXBUFFER:
            /* release Rx buffer by clearing new data flag */
            if(index < 32U) {
                CAN_M_CAN_NDAT1(can_periph) = ((uint32_t)1U << index);
            } else {
                CAN_M_CAN_NDAT2(can_periph) = ((uint32_t)1U << (index - 32U));
            }
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      get high priority CAN message (API_ID(0x003CU))
    \param[in]  high_message: high priority message state structure
                  storage_addr: 0~0xFFFFFFFF
                  match_filter_addr: 0~0xFFFFFFFF
                  storage_indicator: -1, 0, CAN_MSI_RXFIFO0, CAN_MSI_RXFIFO1
    \param[out] none
    \retval     can_receive_message_struct: received message structure
*/
can_receive_message_struct can_high_priority_message_receive(can_high_prio_message_state_struct high_message)
{
    can_receive_message_struct receive_message;
    uint32_t storage_addr = high_message.storage_addr;;

    /* initialize receive message with zeros */
    can_struct_para_init(CAN_RX_MESSAGE_STRUCT, &receive_message);

    /* check if message is available, and storage address is valid */
    if((((int)CAN_MSI_RXFIFO0 == high_message.storage_indicator) ||
            ((int)CAN_MSI_RXFIFO1 == high_message.storage_indicator)) &&
            (0U != storage_addr)) {
        /* receive message from storage address using the existing function */
        receive_message = can_receive_by_addr(storage_addr);
    }

    return receive_message;
}

/*!
    \brief      get high priority message state (API_ID(0x003DU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     high priority message state
*/
can_high_prio_message_state_struct can_high_priority_message_state_get(can_dtm_canx_enum dtm_canx)
{
    can_high_prio_message_state_struct state;
    uint32_t hpms_reg;
    uint32_t indicator;
    uint32_t mem_address;
    uint32_t ele_size;
    uint32_t can_periph = (uint32_t)dtm_canx;

