sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    /* determine which DTM_CAN is selected */
    mem_address = can_dtm_to_can(dtm_canx);

    /* read high priority message status register */
    hpms_reg = CAN_M_CAN_HPMS(can_periph);

    /* parse status information */
    if(0U != (hpms_reg & CAN_M_CAN_HPMS_FLST)) {
        state.match_filter_addr = mem_address + GET_XIDFC_FLESA(CAN_M_CAN_XIDFC(can_periph)) * 4U + GET_HPMS_FIDX(hpms_reg) * CAN_FLITER_ES_EXT;
    } else {
        state.match_filter_addr = mem_address + GET_SIDFC_FLSSA(CAN_M_CAN_SIDFC(can_periph)) * 4U + GET_HPMS_FIDX(hpms_reg) * CAN_FLITER_ES_STD;
    }

    indicator = GET_HPMS_MSI(hpms_reg);
    if((uint32_t)CAN_MSI_RXFIFO0 == indicator) {
        ele_size = GET_RXESC_F0DS(CAN_M_CAN_RXESC(can_periph));
        state.storage_addr = mem_address + GET_RXFXC_FSA(CAN_M_CAN_RXF0C(can_periph)) * 4U + GET_HPMS_BIDX(hpms_reg) * fifo_element_sz[ele_size];
        state.storage_indicator = (int)CAN_MSI_RXFIFO0;
    } else if((uint32_t)CAN_MSI_RXFIFO1 == indicator) {
        ele_size = GET_RXESC_F1DS(CAN_M_CAN_RXESC(can_periph));
        state.storage_addr = mem_address + GET_RXFXC_FSA(CAN_M_CAN_RXF1C(can_periph)) * 4U + GET_HPMS_BIDX(hpms_reg) * fifo_element_sz[ele_size];
        state.storage_indicator = (int)CAN_MSI_RXFIFO1;
    } else if((uint32_t)CAN_MSI_MESSAGE_LOST == indicator) {
        state.storage_addr = 0U;
        state.storage_indicator = -1;
    } else {
        state.storage_addr = 0U;
        state.storage_indicator = 0;
    }

    return state;
}

/*!
    \brief      get CAN FD protocol status information (API_ID(0x003EU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     can_fd_protocol_status_struct
*/
can_fd_protocol_status_struct can_fd_protocol_state_info_get(can_dtm_canx_enum dtm_canx)
{
    can_fd_protocol_status_struct fd_status;
    uint16_t reg_val;

    /* read PSR register byte 2 */
    reg_val = (uint16_t)CAN_M_CAN_PSR_BYTE2((uint32_t)dtm_canx) << 8U;

    /* get protocol exception event flag */
    if(0U != (reg_val & CAN_M_CAN_PSR_PXE)) {
        fd_status.protocol_exp = SET;
    } else {
        fd_status.protocol_exp = RESET;
    }

    /* get FD message received flag */
    if(0U != (reg_val & CAN_M_CAN_PSR_RFDF)) {
        fd_status.fd_message_received = SET;
    } else {
        fd_status.fd_message_received = RESET;
    }

    /* get BRS flag of last received CAN FD message */
    if(0U != (reg_val & CAN_M_CAN_PSR_RBRS)) {
        fd_status.brs_of_last_rx = SET;
    } else {
        fd_status.brs_of_last_rx = RESET;
    }

    /* get ESI flag of last received CAN FD message */
    if(0U != (reg_val & CAN_M_CAN_PSR_RESI)) {
        fd_status.esi_of_last_rx = SET;
    } else {
        fd_status.esi_of_last_rx = RESET;
    }

    /* get data phase last error code */
    reg_val = (uint16_t)(reg_val & CAN_M_CAN_PSR_DLEC) >> CAN_M_CAN_PSR_DLEC_OFFSET;
    fd_status.data_phase_errcode = (can_error_enum)reg_val;

    return fd_status;
}

/*!
    \brief      get CAN protocol state information (API_ID(0x003FU))
                notice call this function will also reset bit PXE, RFDF, RBRS, RESI bits in CAN_M_CAN_PSR register
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     can_protocol_status_struct
*/
can_protocol_status_struct can_protocol_state_info_get(can_dtm_canx_enum dtm_canx)
{
    can_protocol_status_struct protocol_status;
    uint32_t reg_val, temp;

    /* read PSR register */
    reg_val = CAN_M_CAN_PSR((uint32_t)dtm_canx);

    /* get bus_off status */
    if(0U != (reg_val & CAN_M_CAN_PSR_BO)) {
        protocol_status.bus_off = SET;
    } else {
        protocol_status.bus_off = RESET;
    }

    /* get warning status */
    if(0U != (reg_val & CAN_M_CAN_PSR_EW)) {
        protocol_status.error_warning = SET;
    } else {
        protocol_status.error_warning = RESET;
    }

    /* get error passive state */
    if(0U != (reg_val & CAN_M_CAN_PSR_EP)) {
        protocol_status.error_passive = SET;
    } else {
        protocol_status.error_passive = RESET;
    }

    /* get CAN communication state */
    temp = (reg_val & CAN_M_CAN_PSR_ACT) >> CAN_M_CAN_PSR_ACT_OFFSET;
    protocol_status.node = (can_activity_enum)temp;

    /* get last error code */
    temp = reg_val & CAN_M_CAN_PSR_LEC;
    protocol_status.errcode = (can_error_enum)temp;

    return protocol_status;
}

/*!
    \brief      get CAN error counter (API_ID(0x0040U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     can_error_cnt_struct
*/
can_error_cnt_struct can_communication_error_counter_get(can_dtm_canx_enum dtm_canx)
{
    uint32_t ecr_reg;
    can_error_cnt_struct error_counter;

    /* get error counter register */
    ecr_reg = CAN_M_CAN_ECR((uint32_t)dtm_canx);

    /* extract RX and TX error counter values */
    error_counter.rx_err_cnt = (uint8_t)GET_ECR_REC(ecr_reg);
    error_counter.tx_err_cnt = (uint8_t)GET_ECR_TEC(ecr_reg);
    error_counter.err_logging = (uint8_t)GET_ECR_CEL(ecr_reg);
    if(0U != (ecr_reg & CAN_M_CAN_ECR_RP)) {
        error_counter.rx_err_passive = SET;
    } else {
        error_counter.rx_err_passive = RESET;
    }

    return error_counter;
}

/*!
    \brief      get all DMU queueing counters (API_ID(0x0041U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     can_dmu_queue_cnt_struct
*/
can_dmu_queue_cnt_struct can_dmu_queue_counter_get(can_dtm_canx_enum dtm_canx)
{
    uint32_t dmuqc_reg;
    can_dmu_queue_cnt_struct queue_counter;

    /* get DMU queue counter register */
    dmuqc_reg = CAN_DMU_DMUQC((uint32_t)dtm_canx);

    /* extract counter values */
    queue_counter.tx_enqueue_cnt = (uint8_t)GET_DMUQC_TXEEC(dmuqc_reg);
    queue_counter.rx0_dequeue_cnt = (uint8_t)GET_DMUQC_RX0EDC(dmuqc_reg);
    queue_counter.rx1_dequeue_cnt = (uint8_t)GET_DMUQC_RX1EDC(dmuqc_reg);
    queue_counter.tx_event_dequeue_cnt = (uint8_t)GET_DMUQC_TXEEDC(dmuqc_reg);

    return queue_counter;
}

/*!
    \brief      reset all DMU counters (API_ID(0x0042U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     none
*/
void can_dmu_counter_reset(can_dtm_canx_enum dtm_canx)
{
    /* write any value to reset the counters */
    CAN_DMU_DMUQC((uint32_t)dtm_canx) = 0xFFFFFFFFU;
}

/*!
    \brief      get DMU internal finite state machine (API_ID(0x0043U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     can_dmu_internal_struct
*/
can_dmu_internal_struct can_dmu_internal_fsm_get(can_dtm_canx_enum dtm_canx)
{
    can_dmu_internal_struct dmu_internal;
    uint32_t reg_val;

    /* get DMU interface register value */
    reg_val = CAN_DMU_DMUI((uint32_t)dtm_canx);
    dmu_internal.txr = reg_val & CAN_DMU_DMUI_TXR;
    dmu_internal.rx0r = (reg_val & CAN_DMU_DMUI_RX0R) >> CAN_DMUI_RX0R_OFFSET;
    dmu_internal.rx1r = (reg_val & CAN_DMU_DMUI_RX1R) >> CAN_DMUI_RX1R_OFFSET;
    dmu_internal.txer = (reg_val & CAN_DMU_DMUI_TXER) >> CAN_DMUI_TXER_OFFSET;
    dmu_internal.tx_fq_put_index_pre = (reg_val & CAN_DMU_DMUI_TFQPIP) >> CAN_DMUI_TFQPIP_OFFSET;
    dmu_internal.dmu_en = (reg_val & CAN_DMU_DMUI_ENA) >> CAN_DMUI_ENA_OFFSET;
    dmu_internal.dmu_elem_handler_state = (reg_val & CAN_DMU_DMUI_EHS) >> CAN_DMUI_EHS_OFFSET;
    dmu_internal.tx_serve = (reg_val & CAN_DMU_DMUI_TX) >> CAN_DMUI_TX_OFFSET;
    dmu_internal.rx0_serve = (reg_val & CAN_DMU_DMUI_RX0) >> CAN_DMUI_RX0_OFFSET;
    dmu_internal.rx1_serve = (reg_val & CAN_DMU_DMUI_RX1) >> CAN_DMUI_RX1_OFFSET;
    dmu_internal.txe_serve = (reg_val & CAN_DMU_DMUI_TXE) >> CAN_DMUI_TXE_OFFSET;

