sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    return dmu_internal;
}

/*!
    \brief      configure CAN interrupt line (API_ID(0x0044U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  line_number: interrupt line number
                only one parameter can be selected which is shown as below:
      \arg        CAN_INTR_LINE0: interrupt line 0
      \arg        CAN_INTR_LINE1: interrupt line 1
    \param[in]  interrupt: interrupt sources
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_RFIFO0_NEW: Rx FIFO 0 new message interrupt
      \arg        CAN_INT_RFIFO0_WM: Rx FIFO 0 watermark reached interrupt
      \arg        CAN_INT_RFIFO0_FULL: Rx FIFO 0 full interrupt
      \arg        CAN_INT_RFIFO0_MESLOST: Rx FIFO 0 message lost interrupt
      \arg        CAN_INT_RFIFO1_NEW: Rx FIFO 1 new message interrupt
      \arg        CAN_INT_RFIFO1_WM: Rx FIFO 1 watermark reached interrupt
      \arg        CAN_INT_RFIFO1_FULL: Rx FIFO 1 full interrupt
      \arg        CAN_INT_RFIFO1_MESLOST: Rx FIFO 1 message lost interrupt
      \arg        CAN_INT_HIGH_PRI_MES: high priority message interrupt
      \arg        CAN_INT_TX_COMPLETE: transmission completed interrupt
      \arg        CAN_INT_TX_CANCELLED: transmission cancellation finished interrupt
      \arg        CAN_INT_TXFIFO_EMPTY: Tx FIFO empty interrupt
      \arg        CAN_INT_TXEVFIFO_NEW: Tx event FIFO new entry interrupt
      \arg        CAN_INT_TXEVFIFO_WM: Tx event FIFO watermark reached interrupt
      \arg        CAN_INT_TXEVFIFO_FULL: Tx event FIFO full interrupt
      \arg        CAN_INT_TXEVFIFO_ELELOST: Tx event FIFO element lost interrupt
      \arg        CAN_INT_TIMESTAMP_WRAP: timestamp wraparound interrupt
      \arg        CAN_INT_RAM_ACCESS_FAIL: message RAM access failure interrupt
      \arg        CAN_INT_TIMEOUT: timeout occurred interrupt
      \arg        CAN_INT_RXBUFFER_NEW: message stored to dedicated Rx buffer interrupt
      \arg        CAN_INT_ERRLOG_OVERFLOW: error logging overflow interrupt
      \arg        CAN_INT_ERR_PASSIVE_CHANGE: error passive interrupt
      \arg        CAN_INT_WARNING_CHANGE: warning status interrupt
      \arg        CAN_INT_BUSOFF_CHANGE: bus_off status interrupt
      \arg        CAN_INT_WATCHDOG: watchdog interrupt
      \arg        CAN_INT_PROT_ERR_ARBITRATION: protocol error in arbitration phase interrupt
      \arg        CAN_INT_PROT_ERR_DATA: protocol error in data phase interrupt
    \param[out] none
    \retval     none
*/
void can_mcan_interrupt_line_config(can_dtm_canx_enum dtm_canx, uint8_t line_number, can_dtmcan_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    uint32_t reg_offset = (uint32_t)interrupt >> 6U;

    /* check parameter */
    if(IE_REG_OFFSET != reg_offset) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    } else if(line_number > CAN_INTR_LINE1) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0044U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the interrupt line */
        if(CAN_INTR_LINE0 == line_number) {
            /* assign to line 0 */
            CAN_M_CAN_ILS((uint32_t)dtm_canx) &= ~(uint32_t)interrupt;
        } else {
            /* assign to line 1 */
            CAN_M_CAN_ILS((uint32_t)dtm_canx) |= (uint32_t)interrupt;
        }
    }
}

/*!
    \brief      enable CAN interrupt line (API_ID(0x0045U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  line_number: CAN interrupt line number
                only one parameter can be selected which is shown as below:
      \arg        CAN_INTR_LINE0: CAN interrupt line 0
      \arg        CAN_INTR_LINE1: CAN interrupt line 1
    \param[out] none
    \retval     none
*/
void can_mcan_interrupt_line_enable(can_dtm_canx_enum dtm_canx, uint8_t line_number)
{
    /* check parameter */
    if(CAN_INTR_LINE0 == line_number) {
        /* enable interrupt line 0 */
        CAN_M_CAN_ILE((uint32_t)dtm_canx) |= CAN_M_CAN_ILE_EINT0;
    } else if(CAN_INTR_LINE1 == line_number) {
        /* enable interrupt line 1 */
        CAN_M_CAN_ILE((uint32_t)dtm_canx) |= CAN_M_CAN_ILE_EINT1;
    } else {
        /* parameter error, no operation */
    }
}

/*!
    \brief      disable CAN interrupt line (API_ID(0x0046U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  line_number: CAN interrupt line number
                only one parameter can be selected which is shown as below:
      \arg        CAN_INTR_LINE0: CAN interrupt line 0
      \arg        CAN_INTR_LINE1: CAN interrupt line 1
    \param[out] none
    \retval     none
*/
void can_mcan_interrupt_line_disable(can_dtm_canx_enum dtm_canx, uint8_t line_number)
{
    /* check parameter */
    if(CAN_INTR_LINE0 == line_number) {
        /* disable interrupt line 0 */
        CAN_M_CAN_ILE((uint32_t)dtm_canx) &= ~CAN_M_CAN_ILE_EINT0;
    } else if(CAN_INTR_LINE1 == line_number) {
        /* disable interrupt line 1 */
        CAN_M_CAN_ILE((uint32_t)dtm_canx) &= ~CAN_M_CAN_ILE_EINT1;
    } else {
        /* parameter error, no operation */
    }
}

/*!
    \brief      get CAN memory error flag (API_ID(0x0047U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  flag: memory error flags
                only one parameter can be selected which is shown as below:
      \arg        CAN_FLAG_NCE_EAE: noncorrectable ECC after EDC error flag
      \arg        CAN_FLAG_NCE_AEDC: noncorrectable address EDC error flag
      \arg        CAN_FLAG_NCDE: noncorrectable double bit error flag
      \arg        CAN_FLAG_BUFOV: correctable error record buffer overflow flag
      \arg        CAN_FLAG_CEOV: correctable error overflow flag
      \arg        CAN_FLAG_NCEOV: noncorrectable error overflow flag
      \arg        CAN_FLAG_CE: correctable error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_memerr_flag_get(can_dtm_canx_enum dtm_canx, can_memerr_flag_enum flag)
{
    FlagStatus ret = RESET;
    uint32_t can_periph;

    can_periph = can_dtm_to_can(dtm_canx);

    /* check the memory error flag */
    if(0U != (CAN_MERRSTAT(can_periph) & (uint32_t)flag)) {
        ret = SET;
    }
    return ret;
}

/*!
    \brief      clear CAN memory error flag (API_ID(0x0048U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  flag: memory error flags
                only one parameter can be selected which is shown as below:
      \arg        CAN_FLAG_NCE_EAE: noncorrectable ECC after EDC error flag
      \arg        CAN_FLAG_NCE_AEDC: noncorrectable address EDC error flag
      \arg        CAN_FLAG_NCDE: noncorrectable double bit error flag
      \arg        CAN_FLAG_BUFOV: correctable error record buffer overflow flag
      \arg        CAN_FLAG_CEOV: correctable error overflow flag
      \arg        CAN_FLAG_NCEOV: noncorrectable error overflow flag
      \arg        CAN_FLAG_CE: correctable error flag
    \param[out] none
    \retval     none
*/
void can_memerr_flag_clear(can_dtm_canx_enum dtm_canx, can_memerr_flag_enum flag)
{
    uint32_t can_periph;

    can_periph = can_dtm_to_can(dtm_canx);
    /* clear the memory error flag */
    CAN_MERRSTAT(can_periph) = (uint32_t)flag;
}

/*!
    \brief      enable or disable memory ecc interrupt (API_ID(0x0049U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  interrupt: memory error interrupts
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_CE: correctable error interrupt
      \arg        CAN_INT_NCE: noncorrectable error interrupt
    \param[out] none
    \retval     none
*/
void can_memerr_interrupt_enable(can_dtm_canx_enum dtm_canx, can_memerr_interrupt_enum interrupt)
{
    uint32_t can_periph;

    can_periph = can_dtm_to_can(dtm_canx);

    /* enable CAN_MERRCTL register write */
    CAN_CTL(can_periph) |= CAN_CTL_ECRWEN;
    /* clear RWDIS bit */
    CAN_MERRCTL(can_periph) &= ~CAN_MERRCTL_RWDIS;

    /* enable the selected interrupt */
    CAN_MERRCTL(can_periph) |= (uint32_t)interrupt;
}

/*!
    \brief      disable CAN interrupt (API_ID(0x004AU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  interrupt: memory error interrupts
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_CE: correctable error interrupt
      \arg        CAN_INT_NCE: noncorrectable error interrupt
    \param[out] none
    \retval     none
*/
void can_memerr_interrupt_disable(can_dtm_canx_enum dtm_canx, can_memerr_interrupt_enum interrupt)
{
    uint32_t can_periph;

    can_periph = can_dtm_to_can(dtm_canx);

    /* enable CAN_MERRCTL register write */
    CAN_CTL(can_periph) |= CAN_CTL_ECRWEN;
    /* clear RWDIS bit */
    CAN_MERRCTL(can_periph) &= ~CAN_MERRCTL_RWDIS;

    /* disable the selected interrupt */
    CAN_MERRCTL(can_periph) &= ~(uint32_t)interrupt;
}

/*!
    \brief      get CAN interrupt flag (API_ID(0x004BU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  int_flag: memory error interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_FLAG_CE: correctable error interrupt flag
      \arg        CAN_INT_FLAG_NCE: noncorrectable error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_memerr_interrupt_flag_get(can_dtm_canx_enum dtm_canx, can_memerr_interrupt_flag_enum int_flag)
{
    uint32_t val;
    FlagStatus ret = RESET;
    uint32_t can_periph, merrctl;

    can_periph = can_dtm_to_can(dtm_canx);

    /* get the interrupt flag */
    val = CAN_MERRSTAT(can_periph) & (uint32_t)int_flag;
    merrctl = CAN_MERRCTL(can_periph);

    /* check if interrupt is enabled for the flag */
    if(CAN_INT_FLAG_CE == int_flag) {
        if((0U != val) && (0U != (merrctl & (uint32_t)CAN_INT_CE))) {
            ret = SET;
        }
    } else {
        /* for CAN_INT_FLAG_NCE */
        if((0U != val) && (0U != (merrctl & (uint32_t)CAN_INT_NCE))) {
            ret = SET;
        }
    }

    return ret;
}

/*!
    \brief      clear CAN interrupt flag (API_ID(0x004CU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  int_flag: memory error interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_FLAG_CE: correctable error interrupt flag
      \arg        CAN_INT_FLAG_NCE: noncorrectable error interrupt flag
    \param[out] none
    \retval     none
*/
void can_memerr_interrupt_flag_clear(can_dtm_canx_enum dtm_canx, can_memerr_interrupt_flag_enum int_flag)
{
    uint32_t can_periph;

    can_periph = can_dtm_to_can(dtm_canx);
    /* clear the interrupt flag */
    CAN_MERRSTAT(can_periph) = (uint32_t)int_flag;
}

/*!
    \brief      get CAN flag (API_ID(0x004DU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  flag: CAN flags
                only one parameter can be selected which is shown as below:
      \arg        CAN_FLAG_RFIFO0_NEW: Rx FIFO 0 new message flag
      \arg        CAN_FLAG_RFIFO0_WM: Rx FIFO 0 watermark reached flag
      \arg        CAN_FLAG_RFIFO0_FULL: Rx FIFO 0 full flag
      \arg        CAN_FLAG_RFIFO0_MESLOST: Rx FIFO 0 message lost flag
      \arg        CAN_FLAG_RFIFO1_NEW: Rx FIFO 1 new message flag
      \arg        CAN_FLAG_RFIFO1_WM: Rx FIFO 1 watermark reached flag
      \arg        CAN_FLAG_RFIFO1_FULL: Rx FIFO 1 full flag
      \arg        CAN_FLAG_RFIFO1_MESLOST: Rx FIFO 1 message lost flag
      \arg        CAN_FLAG_HIGH_PRI_MES: high priority message flag
      \arg        CAN_FLAG_TX_COMPLETE: transmission completed flag
      \arg        CAN_FLAG_TX_CANCELLED: transmission cancellation finished flag
      \arg        CAN_FLAG_TXFIFO_EMPTY: Tx FIFO empty flag
      \arg        CAN_FLAG_TXEVFIFO_NEW: Tx event FIFO new entry flag
      \arg        CAN_FLAG_TXEVFIFO_WM: Tx event FIFO watermark reached flag
      \arg        CAN_FLAG_TXEVFIFO_FULL: Tx event FIFO full flag
      \arg        CAN_FLAG_TXEVFIFO_ELELOST: Tx event FIFO element lost flag
      \arg        CAN_FLAG_TIMESTAMP_WRAP: timestamp wraparound flag
      \arg        CAN_FLAG_RAM_ACCESS_FAIL: message RAM access failure flag
      \arg        CAN_FLAG_TIMEOUT: timeout occurred flag
      \arg        CAN_FLAG_RXBUFFER_NEW: message stored to dedicated Rx buffer flag
      \arg        CAN_FLAG_ERRLOG_OVERFLOW: error logging overflow flag
      \arg        CAN_FLAG_ERR_PASSIVE_CHANGE: error passive flag
      \arg        CAN_FLAG_WARNING_CHANGE: warning status flag
      \arg        CAN_FLAG_BUSOFF_CHANGE: bus_off status flag
      \arg        CAN_FLAG_WATCHDOG: watchdog flag
      \arg        CAN_FLAG_PROT_ERR_ARBITRATION: protocol error in arbitration phase flag
      \arg        CAN_FLAG_PROT_ERR_DATA: protocol error in data phase flag
      \arg        CAN_FLAG_TXBUF0_COMPLETE: Tx buffer 0 transmission flag
      \arg        CAN_FLAG_TXBUF1_COMPLETE: Tx buffer 1 transmission flag
      \arg        CAN_FLAG_TXBUF2_COMPLETE: Tx buffer 2 transmission flag
      \arg        CAN_FLAG_TXBUF3_COMPLETE: Tx buffer 3 transmission flag
      \arg        CAN_FLAG_TXBUF4_COMPLETE: Tx buffer 4 transmission flag
      \arg        CAN_FLAG_TXBUF5_COMPLETE: Tx buffer 5 transmission flag
      \arg        CAN_FLAG_TXBUF6_COMPLETE: Tx buffer 6 transmission flag
      \arg        CAN_FLAG_TXBUF7_COMPLETE: Tx buffer 7 transmission flag
      \arg        CAN_FLAG_TXBUF8_COMPLETE: Tx buffer 8 transmission flag
      \arg        CAN_FLAG_TXBUF9_COMPLETE: Tx buffer 9 transmission flag
      \arg        CAN_FLAG_TXBUF10_COMPLETE: Tx buffer 10 transmission flag
      \arg        CAN_FLAG_TXBUF11_COMPLETE: Tx buffer 11 transmission flag
      \arg        CAN_FLAG_TXBUF12_COMPLETE: Tx buffer 12 transmission flag
      \arg        CAN_FLAG_TXBUF13_COMPLETE: Tx buffer 13 transmission flag
      \arg        CAN_FLAG_TXBUF14_COMPLETE: Tx buffer 14 transmission flag
      \arg        CAN_FLAG_TXBUF15_COMPLETE: Tx buffer 15 transmission flag
      \arg        CAN_FLAG_TXBUF16_COMPLETE: Tx buffer 16 transmission flag
      \arg        CAN_FLAG_TXBUF17_COMPLETE: Tx buffer 17 transmission flag
      \arg        CAN_FLAG_TXBUF18_COMPLETE: Tx buffer 18 transmission flag
      \arg        CAN_FLAG_TXBUF19_COMPLETE: Tx buffer 19 transmission flag
      \arg        CAN_FLAG_TXBUF20_COMPLETE: Tx buffer 20 transmission flag
      \arg        CAN_FLAG_TXBUF21_COMPLETE: Tx buffer 21 transmission flag
      \arg        CAN_FLAG_TXBUF22_COMPLETE: Tx buffer 22 transmission flag
      \arg        CAN_FLAG_TXBUF23_COMPLETE: Tx buffer 23 transmission flag
      \arg        CAN_FLAG_TXBUF24_COMPLETE: Tx buffer 24 transmission flag
      \arg        CAN_FLAG_TXBUF25_COMPLETE: Tx buffer 25 transmission flag
      \arg        CAN_FLAG_TXBUF26_COMPLETE: Tx buffer 26 transmission flag
      \arg        CAN_FLAG_TXBUF27_COMPLETE: Tx buffer 27 transmission flag
      \arg        CAN_FLAG_TXBUF28_COMPLETE: Tx buffer 28 transmission flag
      \arg        CAN_FLAG_TXBUF29_COMPLETE: Tx buffer 29 transmission flag
      \arg        CAN_FLAG_TXBUF30_COMPLETE: Tx buffer 30 transmission flag
      \arg        CAN_FLAG_TXBUF31_COMPLETE: Tx buffer 31 transmission flag
      \arg        CAN_FLAG_TXBUF0_CANCELLED: Tx buffer 0 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF1_CANCELLED: Tx buffer 1 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF2_CANCELLED: Tx buffer 2 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF3_CANCELLED: Tx buffer 3 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF4_CANCELLED: Tx buffer 4 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF5_CANCELLED: Tx buffer 5 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF6_CANCELLED: Tx buffer 6 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF7_CANCELLED: Tx buffer 7 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF8_CANCELLED: Tx buffer 8 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF9_CANCELLED: Tx buffer 9 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF10_CANCELLED: Tx buffer 10 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF11_CANCELLED: Tx buffer 11 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF12_CANCELLED: Tx buffer 12 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF13_CANCELLED: Tx buffer 13 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF14_CANCELLED: Tx buffer 14 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF15_CANCELLED: Tx buffer 15 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF16_CANCELLED: Tx buffer 16 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF17_CANCELLED: Tx buffer 17 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF18_CANCELLED: Tx buffer 18 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF19_CANCELLED: Tx buffer 19 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF20_CANCELLED: Tx buffer 20 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF21_CANCELLED: Tx buffer 21 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF22_CANCELLED: Tx buffer 22 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF23_CANCELLED: Tx buffer 23 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF24_CANCELLED: Tx buffer 24 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF25_CANCELLED: Tx buffer 25 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF26_CANCELLED: Tx buffer 26 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF27_CANCELLED: Tx buffer 27 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF28_CANCELLED: Tx buffer 28 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF29_CANCELLED: Tx buffer 29 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF30_CANCELLED: Tx buffer 30 transmission cancel finished flag
      \arg        CAN_FLAG_TXBUF31_CANCELLED: Tx buffer 31 transmission cancel finished flag
      \arg        DMU_FLAG_TX_ELE_NOT_STADDR: TX element not start address flag
      \arg        DMU_FLAG_TX_ELE_ILLE_ENQ: TX element illegal enqueueing flag
      \arg        DMU_FLAG_TX_ELE_ILLE_ACCSEQ: TX element illegal access sequence flag
      \arg        DMU_FLAG_TX_ELE_ILLE_DLC: TX element illegal DLC flag
      \arg        DMU_FLAG_TX_ELE_WRITE_AFTTRIG: TX element write after trigger address flag
      \arg        DMU_FLAG_TX_ELE_ILLE_READ: TX element illegal read flag
      \arg        DMU_FLAG_TX_ELE_ENQ: TX element enqueued flag
      \arg        DMU_FLAG_RX0_ELE_NOT_STADDR: RX0 element not start address flag
      \arg        DMU_FLAG_RX0_ELE_ILLE_DEQ: RX0 element illegal dequeueing flag
      \arg        DMU_FLAG_RX0_ELE_ILLE_ACCSEQ: RX0 element illegal access sequence flag
      \arg        DMU_FLAG_RX0_ELE_ILLE_WRITE: RX0 element illegal write flag
      \arg        DMU_FLAG_RX0_ELE_DEQ: RX0 element dequeued flag
      \arg        DMU_FLAG_RX1_ELE_NOT_STADDR: RX1 element not start address flag
      \arg        DMU_FLAG_RX1_ELE_ILLE_DEQ: RX1 element illegal dequeueing flag
      \arg        DMU_FLAG_RX1_ELE_ILLE_ACCSEQ: RX1 element illegal access sequence flag
      \arg        DMU_FLAG_RX1_ELE_ILLE_WRITE: RX1 element illegal write flag
      \arg        DMU_FLAG_RX1_ELE_DEQ: RX1 element dequeued flag
      \arg        DMU_FLAG_TXEV_ELE_NOT_STADDR: TX event element not start address flag
      \arg        DMU_FLAG_TXEV_ELE_ILLE_DEQ: TX event element illegal dequeueing flag
      \arg        DMU_FLAG_TXEV_ELE_ILLE_ACCSEQ: TX event element illegal access sequence flag
      \arg        DMU_FLAG_TXEV_ELE_ILLE_WRITE: TX event element illegal write flag
      \arg        DMU_FLAG_TXEV_ELE_DEQ: TX event element dequeued flag
      \arg        DMU_FLAG_ILLE_ACC_IN_CONFIG: illegal access while in configuration mode flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_flag_get(can_dtm_canx_enum dtm_canx, can_dtmcan_flag_enum flag)
{
    uint32_t val;
    uint32_t reg;
    FlagStatus reval = RESET;

