sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    /* get the flag register */
    reg = CAN_REG_VAL(dtm_canx, flag);

    /* get the flag bit position */
    val = ((uint32_t)1U << (CAN_BIT_POS(flag)));

    /* check the flag */
    if(0U != (reg & val)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear CAN flag (API_ID(0x004EU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  flag: CAN flags
                only one parameter can be selected which is shown as below:
      \arg        CAN_FLAG_RFIFO0_NEW: Rx FIFO 0 new message flag
      \arg        CAN_FLAG_RFIFO0_WM: Rx FIFO 0 watermark reached flag
      \arg        CAN_FLAG_RFIFO0_FULL: Rx FIFO 0 full flag
      \arg        CAN_FLAG_RFIFO0_MESLOST: Rx FIFO 0 message lost flag
      \arg        CAN_FLAG_RFIFO1_NEW: Rx FIFO 1 new message flag
      \arg        CAN_FLAG_RFIFO1_WM: Rx FIFO 1 watermark reached flag
      \arg        CAN_FLAG_RFIFO1_FULL: Rx FIFO 1 full flag
      \arg        CAN_FLAG_RFIFO1_MESLOST: Rx FIFO 1 message lost flag
      \arg        CAN_FLAG_HIGH_PRI_MES: high priority message flag
      \arg        CAN_FLAG_TX_COMPLETE: transmission completed flag
      \arg        CAN_FLAG_TX_CANCELLED: transmission cancellation finished flag
      \arg        CAN_FLAG_TXFIFO_EMPTY: Tx FIFO empty flag
      \arg        CAN_FLAG_TXEVFIFO_NEW: Tx event FIFO new entry flag
      \arg        CAN_FLAG_TXEVFIFO_WM: Tx event FIFO watermark reached flag
      \arg        CAN_FLAG_TXEVFIFO_FULL: Tx event FIFO full flag
      \arg        CAN_FLAG_TXEVFIFO_ELELOST: Tx event FIFO element lost flag
      \arg        CAN_FLAG_TIMESTAMP_WRAP: timestamp wraparound flag
      \arg        CAN_FLAG_RAM_ACCESS_FAIL: message RAM access failure flag
      \arg        CAN_FLAG_TIMEOUT: timeout occurred flag
      \arg        CAN_FLAG_RXBUFFER_NEW: message stored to dedicated Rx buffer flag
      \arg        CAN_FLAG_ERRLOG_OVERFLOW: error logging overflow flag
      \arg        CAN_FLAG_ERR_PASSIVE_CHANGE: error passive flag
      \arg        CAN_FLAG_WARNING_CHANGE: warning status flag
      \arg        CAN_FLAG_BUSOFF_CHANGE: bus_off status flag
      \arg        CAN_FLAG_WATCHDOG: watchdog flag
      \arg        CAN_FLAG_PROT_ERR_ARBITRATION: protocol error in arbitration phase flag
      \arg        CAN_FLAG_PROT_ERR_DATA: protocol error in data phase flag
      \arg        DMU_FLAG_TX_ELE_NOT_STADDR: TX element not start address flag
      \arg        DMU_FLAG_TX_ELE_ILLE_ENQ: TX element illegal enqueueing flag
      \arg        DMU_FLAG_TX_ELE_ILLE_ACCSEQ: TX element illegal access sequence flag
      \arg        DMU_FLAG_TX_ELE_ILLE_DLC: TX element illegal DLC flag
      \arg        DMU_FLAG_TX_ELE_WRITE_AFTTRIG: TX element write after trigger address flag
      \arg        DMU_FLAG_TX_ELE_ILLE_READ: TX element illegal read flag
      \arg        DMU_FLAG_TX_ELE_ENQ: TX element enqueued flag
      \arg        DMU_FLAG_RX0_ELE_NOT_STADDR: RX0 element not start address flag
      \arg        DMU_FLAG_RX0_ELE_ILLE_DEQ: RX0 element illegal dequeueing flag
      \arg        DMU_FLAG_RX0_ELE_ILLE_ACCSEQ: RX0 element illegal access sequence flag
      \arg        DMU_FLAG_RX0_ELE_ILLE_WRITE: RX0 element illegal write flag
      \arg        DMU_FLAG_RX0_ELE_DEQ: RX0 element dequeued flag
      \arg        DMU_FLAG_RX1_ELE_NOT_STADDR: RX1 element not start address flag
      \arg        DMU_FLAG_RX1_ELE_ILLE_DEQ: RX1 element illegal dequeueing flag
      \arg        DMU_FLAG_RX1_ELE_ILLE_ACCSEQ: RX1 element illegal access sequence flag
      \arg        DMU_FLAG_RX1_ELE_ILLE_WRITE: RX1 element illegal write flag
      \arg        DMU_FLAG_RX1_ELE_DEQ: RX1 element dequeued flag
      \arg        DMU_FLAG_TXEV_ELE_NOT_STADDR: TX event element not start address flag
      \arg        DMU_FLAG_TXEV_ELE_ILLE_DEQ: TX event element illegal dequeueing flag
      \arg        DMU_FLAG_TXEV_ELE_ILLE_ACCSEQ: TX event element illegal access sequence flag
      \arg        DMU_FLAG_TXEV_ELE_ILLE_WRITE: TX event element illegal write flag
      \arg        DMU_FLAG_TXEV_ELE_DEQ: TX event element dequeued flag
      \arg        DMU_FLAG_ILLE_ACC_IN_CONFIG: illegal access while in configuration mode flag
    \param[out] none
    \retval     none
*/
void can_flag_clear(can_dtm_canx_enum dtm_canx, can_dtmcan_flag_enum flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    uint32_t reg_offset = (uint32_t)flag >> 6U;

    /* check parameter */
    if(PSR_REG_OFFSET == reg_offset) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x004EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear the flag */
        CAN_REG_VAL(dtm_canx, flag) = ((uint32_t)1U << (CAN_BIT_POS(flag)));
    }
}

/*!
    \brief      enable CAN interrupt (API_ID(0x004FU))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  interrupt: interrupt sources
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_RFIFO0_NEW: Rx FIFO 0 new message interrupt
      \arg        CAN_INT_RFIFO0_WM: Rx FIFO 0 watermark reached interrupt
      \arg        CAN_INT_RFIFO0_FULL: Rx FIFO 0 full interrupt
      \arg        CAN_INT_RFIFO0_MESLOST: Rx FIFO 0 message lost interrupt
      \arg        CAN_INT_RFIFO1_NEW: Rx FIFO 1 new message interrupt
      \arg        CAN_INT_RFIFO1_WM: Rx FIFO 1 watermark reached interrupt
      \arg        CAN_INT_RFIFO1_FULL: Rx FIFO 1 full interrupt
      \arg        CAN_INT_RFIFO1_MESLOST: Rx FIFO 1 message lost interrupt
      \arg        CAN_INT_HIGH_PRI_MES: high priority message interrupt
      \arg        CAN_INT_TX_COMPLETE: transmission completed interrupt
      \arg        CAN_INT_TX_CANCELLED: transmission cancellation finished interrupt
      \arg        CAN_INT_TXFIFO_EMPTY: Tx FIFO empty interrupt
      \arg        CAN_INT_TXEVFIFO_NEW: Tx event FIFO new entry interrupt
      \arg        CAN_INT_TXEVFIFO_WM: Tx event FIFO watermark reached interrupt
      \arg        CAN_INT_TXEVFIFO_FULL: Tx event FIFO full interrupt
      \arg        CAN_INT_TXEVFIFO_ELELOST: Tx event FIFO element lost interrupt
      \arg        CAN_INT_TIMESTAMP_WRAP: timestamp wraparound interrupt
      \arg        CAN_INT_RAM_ACCESS_FAIL: message RAM access failure interrupt
      \arg        CAN_INT_TIMEOUT: timeout occurred interrupt
      \arg        CAN_INT_RXBUFFER_NEW: message stored to dedicated Rx buffer interrupt
      \arg        CAN_INT_ERRLOG_OVERFLOW: error logging overflow interrupt
      \arg        CAN_INT_ERR_PASSIVE_CHANGE: error passive interrupt
      \arg        CAN_INT_WARNING_CHANGE: warning status interrupt
      \arg        CAN_INT_BUSOFF_CHANGE: bus_off status interrupt
      \arg        CAN_INT_WATCHDOG: watchdog interrupt
      \arg        CAN_INT_PROT_ERR_ARBITRATION: protocol error in arbitration phase interrupt
      \arg        CAN_INT_PROT_ERR_DATA: protocol error in data phase interrupt
      \arg        CAN_INT_TXBUF0_COMPLETE: Tx buffer 0 transmission interrupt
      \arg        CAN_INT_TXBUF1_COMPLETE: Tx buffer 1 transmission interrupt
      \arg        CAN_INT_TXBUF2_COMPLETE: Tx buffer 2 transmission interrupt
      \arg        CAN_INT_TXBUF3_COMPLETE: Tx buffer 3 transmission interrupt
      \arg        CAN_INT_TXBUF4_COMPLETE: Tx buffer 4 transmission interrupt
      \arg        CAN_INT_TXBUF5_COMPLETE: Tx buffer 5 transmission interrupt
      \arg        CAN_INT_TXBUF6_COMPLETE: Tx buffer 6 transmission interrupt
      \arg        CAN_INT_TXBUF7_COMPLETE: Tx buffer 7 transmission interrupt
      \arg        CAN_INT_TXBUF8_COMPLETE: Tx buffer 8 transmission interrupt
      \arg        CAN_INT_TXBUF9_COMPLETE: Tx buffer 9 transmission interrupt
      \arg        CAN_INT_TXBUF10_COMPLETE: Tx buffer 10 transmission interrupt
      \arg        CAN_INT_TXBUF11_COMPLETE: Tx buffer 11 transmission interrupt
      \arg        CAN_INT_TXBUF12_COMPLETE: Tx buffer 12 transmission interrupt
      \arg        CAN_INT_TXBUF13_COMPLETE: Tx buffer 13 transmission interrupt
      \arg        CAN_INT_TXBUF14_COMPLETE: Tx buffer 14 transmission interrupt
      \arg        CAN_INT_TXBUF15_COMPLETE: Tx buffer 15 transmission interrupt
      \arg        CAN_INT_TXBUF16_COMPLETE: Tx buffer 16 transmission interrupt
      \arg        CAN_INT_TXBUF17_COMPLETE: Tx buffer 17 transmission interrupt
      \arg        CAN_INT_TXBUF18_COMPLETE: Tx buffer 18 transmission interrupt
      \arg        CAN_INT_TXBUF19_COMPLETE: Tx buffer 19 transmission interrupt
      \arg        CAN_INT_TXBUF20_COMPLETE: Tx buffer 20 transmission interrupt
      \arg        CAN_INT_TXBUF21_COMPLETE: Tx buffer 21 transmission interrupt
      \arg        CAN_INT_TXBUF22_COMPLETE: Tx buffer 22 transmission interrupt
      \arg        CAN_INT_TXBUF23_COMPLETE: Tx buffer 23 transmission interrupt
      \arg        CAN_INT_TXBUF24_COMPLETE: Tx buffer 24 transmission interrupt
      \arg        CAN_INT_TXBUF25_COMPLETE: Tx buffer 25 transmission interrupt
      \arg        CAN_INT_TXBUF26_COMPLETE: Tx buffer 26 transmission interrupt
      \arg        CAN_INT_TXBUF27_COMPLETE: Tx buffer 27 transmission interrupt
      \arg        CAN_INT_TXBUF28_COMPLETE: Tx buffer 28 transmission interrupt
      \arg        CAN_INT_TXBUF29_COMPLETE: Tx buffer 29 transmission interrupt
      \arg        CAN_INT_TXBUF30_COMPLETE: Tx buffer 30 transmission interrupt
      \arg        CAN_INT_TXBUF31_COMPLETE: Tx buffer 31 transmission interrupt
      \arg        CAN_INT_TXBUF0_CANCELLED: Tx buffer 0 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF1_CANCELLED: Tx buffer 1 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF2_CANCELLED: Tx buffer 2 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF3_CANCELLED: Tx buffer 3 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF4_CANCELLED: Tx buffer 4 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF5_CANCELLED: Tx buffer 5 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF6_CANCELLED: Tx buffer 6 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF7_CANCELLED: Tx buffer 7 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF8_CANCELLED: Tx buffer 8 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF9_CANCELLED: Tx buffer 9 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF10_CANCELLED: Tx buffer 10 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF11_CANCELLED: Tx buffer 11 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF12_CANCELLED: Tx buffer 12 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF13_CANCELLED: Tx buffer 13 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF14_CANCELLED: Tx buffer 14 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF15_CANCELLED: Tx buffer 15 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF16_CANCELLED: Tx buffer 16 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF17_CANCELLED: Tx buffer 17 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF18_CANCELLED: Tx buffer 18 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF19_CANCELLED: Tx buffer 19 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF20_CANCELLED: Tx buffer 20 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF21_CANCELLED: Tx buffer 21 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF22_CANCELLED: Tx buffer 22 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF23_CANCELLED: Tx buffer 23 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF24_CANCELLED: Tx buffer 24 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF25_CANCELLED: Tx buffer 25 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF26_CANCELLED: Tx buffer 26 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF27_CANCELLED: Tx buffer 27 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF28_CANCELLED: Tx buffer 28 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF29_CANCELLED: Tx buffer 29 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF30_CANCELLED: Tx buffer 30 transmission cancel finished interrupt
      \arg        CAN_INT_TXBUF31_CANCELLED: Tx buffer 31 transmission cancel finished interrupt
      \arg        DMU_INT_TX_ELE_NOT_STADDR: TX element not start address interrupt
      \arg        DMU_INT_TX_ELE_ILLE_ENQ: TX element illegal enqueueing interrupt
      \arg        DMU_INT_TX_ELE_ILLE_ACCSEQ: TX element illegal access sequence interrupt
      \arg        DMU_INT_TX_ELE_ILLE_DLC: TX element illegal DLC interrupt
      \arg        DMU_INT_TX_ELE_WRITE_AFTTRIG: TX element write after trigger address interrupt
      \arg        DMU_INT_TX_ELE_ILLE_READ: TX element illegal read interrupt
      \arg        DMU_INT_TX_ELE_ENQ: TX element enqueued interrupt
      \arg        DMU_INT_RX0_ELE_NOT_STADDR: RX0 element not start address interrupt
      \arg        DMU_INT_RX0_ELE_ILLE_DEQ: RX0 element illegal dequeueing interrupt
      \arg        DMU_INT_RX0_ELE_ILLE_ACCSEQ: RX0 element illegal access sequence interrupt
      \arg        DMU_INT_RX0_ELE_ILLE_WRITE: RX0 element illegal write interrupt
      \arg        DMU_INT_RX0_ELE_DEQ: RX0 element dequeued interrupt
      \arg        DMU_INT_RX1_ELE_NOT_STADDR: RX1 element not start address interrupt
      \arg        DMU_INT_RX1_ELE_ILLE_DEQ: RX1 element illegal dequeueing interrupt
      \arg        DMU_INT_RX1_ELE_ILLE_ACCSEQ: RX1 element illegal access sequence interrupt
      \arg        DMU_INT_RX1_ELE_ILLE_WRITE: RX1 element illegal write interrupt
      \arg        DMU_INT_RX1_ELE_DEQ: RX1 element dequeued interrupt
      \arg        DMU_INT_TXEV_ELE_NOT_STADDR: TX event element not start address interrupt
      \arg        DMU_INT_TXEV_ELE_ILLE_DEQ: TX event element illegal dequeueing interrupt
      \arg        DMU_INT_TXEV_ELE_ILLE_ACCSEQ: TX event element illegal access sequence interrupt
      \arg        DMU_INT_TXEV_ELE_ILLE_WRITE: TX event element illegal write interrupt
      \arg        DMU_INT_TXEV_ELE_DEQ: TX event element dequeued interrupt
      \arg        DMU_INT_ILLE_ACC_IN_CONFIG: illegal access while in configuration mode interrupt
    \param[out] none
    \retval     none
*/
void can_interrupt_enable(can_dtm_canx_enum dtm_canx, can_dtmcan_interrupt_enum interrupt)
{
    CAN_REG_VAL(dtm_canx, interrupt) |= ((uint32_t)1U << (CAN_BIT_POS(interrupt)));
}

