sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    /* get the status of interrupt enable bit */
    ret1 = (CAN_REG_VAL(dtm_canx, int_flag) & BIT(CAN_BIT_POS(int_flag)));
    /* get the status of interrupt flag */
    ret2 = (CAN_REG_VAL2(dtm_canx, int_flag) & BIT(CAN_BIT_POS2(int_flag)));

    if((0U != ret1) && (0U != ret2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear CAN interrupt flag (API_ID(0x0052U))
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[in]  int_flag: interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_FLAG_RFIFO0_NEW: Rx FIFO 0 new message interrupt flag
      \arg        CAN_INT_FLAG_RFIFO0_WM: Rx FIFO 0 watermark reached interrupt flag
      \arg        CAN_INT_FLAG_RFIFO0_FULL: Rx FIFO 0 full interrupt flag
      \arg        CAN_INT_FLAG_RFIFO0_MESLOST: Rx FIFO 0 message lost interrupt flag
      \arg        CAN_INT_FLAG_RFIFO1_NEW: Rx FIFO 1 new message interrupt flag
      \arg        CAN_INT_FLAG_RFIFO1_WM: Rx FIFO 1 watermark reached interrupt flag
      \arg        CAN_INT_FLAG_RFIFO1_FULL: Rx FIFO 1 full interrupt flag
      \arg        CAN_INT_FLAG_RFIFO1_MESLOST: Rx FIFO 1 message lost interrupt flag
      \arg        CAN_INT_FLAG_HIGH_PRI_MES: high priority message interrupt flag
      \arg        CAN_INT_FLAG_TX_COMPLETE: transmission completed interrupt flag
      \arg        CAN_INT_FLAG_TX_CANCELLED: transmission cancellation finished interrupt flag
      \arg        CAN_INT_FLAG_TXFIFO_EMPTY: Tx FIFO empty interrupt flag
      \arg        CAN_INT_FLAG_TXEVFIFO_NEW: Tx event FIFO new entry interrupt flag
      \arg        CAN_INT_FLAG_TXEVFIFO_WM: Tx event FIFO watermark reached interrupt flag
      \arg        CAN_INT_FLAG_TXEVFIFO_FULL: Tx event FIFO full interrupt flag
      \arg        CAN_INT_FLAG_TXEVFIFO_ELELOST: Tx event FIFO element lost interrupt flag
      \arg        CAN_INT_FLAG_TIMESTAMP_WRAP: timestamp wraparound interrupt flag
      \arg        CAN_INT_FLAG_RAM_ACCESS_FAIL: message RAM access failure interrupt flag
      \arg        CAN_INT_FLAG_TIMEOUT: timeout occurred interrupt flag
      \arg        CAN_INT_FLAG_RXBUFFER_NEW: message stored to dedicated Rx buffer interrupt flag
      \arg        CAN_INT_FLAG_ERRLOG_OVERFLOW: error logging overflow interrupt flag
      \arg        CAN_INT_FLAG_ERR_PASSIVE_CHANGE: error passive interrupt flag
      \arg        CAN_INT_FLAG_WARNING_CHANGE: warning status interrupt flag
      \arg        CAN_INT_FLAG_BUSOFF_CHANGE: bus_off status interrupt flag
      \arg        CAN_INT_FLAG_WATCHDOG: watchdog interrupt flag
      \arg        CAN_INT_FLAG_PROT_ERR_ARBITRATION: protocol error in arbitration phase interrupt flag
      \arg        CAN_INT_FLAG_PROT_ERR_DATA: protocol error in data phase interrupt flag
      \arg        DMU_INT_FLAG_TX_ELE_NOT_STADDR: TX element not start address interrupt flag
      \arg        DMU_INT_FLAG_TX_ELE_ILLE_ENQ: TX element illegal enqueueing interrupt flag
      \arg        DMU_INT_FLAG_TX_ELE_ILLE_ACCSEQ: TX element illegal access sequence interrupt flag
      \arg        DMU_INT_FLAG_TX_ELE_ILLE_DLC: TX element illegal DLC interrupt flag
      \arg        DMU_INT_FLAG_TX_ELE_WRITE_AFTTRIG: TX element write after trigger address interrupt flag
      \arg        DMU_INT_FLAG_TX_ELE_ILLE_READ: TX element illegal read interrupt flag
      \arg        DMU_INT_FLAG_TX_ELE_ENQ: TX element enqueued interrupt flag
      \arg        DMU_INT_FLAG_RX0_ELE_NOT_STADDR: RX0 element not start address interrupt flag
      \arg        DMU_INT_FLAG_RX0_ELE_ILLE_DEQ: RX0 element illegal dequeueing interrupt flag
      \arg        DMU_INT_FLAG_RX0_ELE_ILLE_ACCSEQ: RX0 element illegal access sequence interrupt flag
      \arg        DMU_INT_FLAG_RX0_ELE_ILLE_WRITE: RX0 element illegal write interrupt flag
      \arg        DMU_INT_FLAG_RX0_ELE_DEQ: RX0 element dequeued interrupt flag
      \arg        DMU_INT_FLAG_RX1_ELE_NOT_STADDR: RX1 element not start address interrupt flag
      \arg        DMU_INT_FLAG_RX1_ELE_ILLE_DEQ: RX1 element illegal dequeueing interrupt flag
      \arg        DMU_INT_FLAG_RX1_ELE_ILLE_ACCSEQ: RX1 element illegal access sequence interrupt flag
      \arg        DMU_INT_FLAG_RX1_ELE_ILLE_WRITE: RX1 element illegal write interrupt flag
      \arg        DMU_INT_FLAG_RX1_ELE_DEQ: RX1 element dequeued interrupt flag
      \arg        DMU_INT_FLAG_TXEV_ELE_NOT_STADDR: TX event element not start address interrupt flag
      \arg        DMU_INT_FLAG_TXEV_ELE_ILLE_DEQ: TX event element illegal dequeueing interrupt flag
      \arg        DMU_INT_FLAG_TXEV_ELE_ILLE_ACCSEQ: TX event element illegal access sequence interrupt flag
      \arg        DMU_INT_FLAG_TXEV_ELE_ILLE_WRITE: TX event element illegal write interrupt flag
      \arg        DMU_INT_FLAG_TXEV_ELE_DEQ: TX event element dequeued interrupt flag
      \arg        DMU_INT_FLAG_ILLE_ACC_IN_CONFIG: illegal access while in configuration mode interrupt flag
    \param[out] none
    \retval     none
*/
void can_interrupt_flag_clear(can_dtm_canx_enum dtm_canx, can_dtmcan_interrupt_flag_enum int_flag)
{
    /* clear the flag */
    CAN_REG_VAL2(dtm_canx, int_flag) = ((uint32_t)1U << (CAN_BIT_POS2(int_flag)));
}

/*!
    \brief      convert DTM_CANx to CAN
    \param[in]  dtm_canx: DTM_CANx(x=0..7)
    \param[out] none
    \retval     CANx(x=0,1,2)
*/
static uint32_t can_dtm_to_can(can_dtm_canx_enum dtm_canx)
{
    uint32_t can_periph = 0U;

    /* determine which DTM_CAN is selected */
    switch(dtm_canx) {
    case DTM_CAN0:
    case DTM_CAN1:
        can_periph = CAN0;
        break;
    case DTM_CAN2:
    case DTM_CAN3:
    case DTM_CAN4:
        can_periph = CAN1;
        break;
    case DTM_CAN5:
    case DTM_CAN6:
    case DTM_CAN7:
        can_periph = CAN2;
        break;
    default:
        break;
    }
    return can_periph;
}

/*!
    \brief      receive CAN message from a specific memory address
    \param[in]  addr: buffer memory address of the message to read
    \param[out] none
    \retval     can_receive_message_struct
*/
static can_receive_message_struct can_receive_by_addr(uint32_t addr)
{
    can_receive_message_struct receive_message;
    uint32_t *buffer_addr = (uint32_t *)addr;
    uint32_t r0_word;
    uint32_t r1_word;
    uint8_t i, j;
    uint32_t temp;

