sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.c
    can_struct_para_init(CAN_RX_MESSAGE_STRUCT, &receive_message);

    /* read R0 and R1 words */
    r0_word = *buffer_addr;
    buffer_addr++;
    r1_word = *buffer_addr;
    buffer_addr++;

    /* copy R0 and R1 words to message structure */
    receive_message.id = r0_word & CAN_R0_ID;
    receive_message.rtr = (r0_word & CAN_R0_RTR) >> CAN_R0_RTR_OFFSET;
    receive_message.xtd = (r0_word & CAN_R0_XTD) >> CAN_R0_XTD_OFFSET;
    receive_message.esi = (r0_word & CAN_R0_ESI) >> CAN_R0_ESI_OFFSET;
    receive_message.timestamp = r1_word & CAN_R1A_RXTS;
    receive_message.dlc = (r1_word & CAN_R1A_DLC) >> CAN_R1A_DLC_OFFSET;
    receive_message.brs = (r1_word & CAN_R1A_BRS) >> CAN_R1A_BRS_OFFSET;
    receive_message.fdf = (r1_word & CAN_R1A_FDF) >> CAN_R1A_FDF_OFFSET;
    receive_message.filter_index = (r1_word & CAN_R1A_FIDX) >> CAN_R1A_FIDX_OFFSET;
    receive_message.non_match = (r1_word & CAN_R1A_ANMF) >> CAN_R1A_ANMF_OFFSET;

    /* if is standard identifier */
    if(0U == receive_message.xtd) {
        receive_message.id >>= 18U;
    }

    /* calculate data length */
    receive_message.data_bytes = dlc_to_databytes[receive_message.dlc];

    /* read data bytes */
    j = (uint8_t)((receive_message.data_bytes + 3U) / 4U);
    for(i = 0U; i < j; i++) {
        temp = *(uint32_t *)buffer_addr;
        receive_message.data[i * 4U] = (uint8_t)(temp & 0xFFU);
        receive_message.data[i * 4U + 1U] = (uint8_t)((temp & 0xFF00U) >> 8U);
        receive_message.data[i * 4U + 2U] = (uint8_t)((temp & 0xFF0000U) >> 16U);
        receive_message.data[i * 4U + 3U] = (uint8_t)((temp & 0xFF000000U) >> 24U);

        buffer_addr++;
    }

    /* handle partial data bytes */
    j = (uint8_t)(receive_message.data_bytes % 4U);
    if(1U == j) {
        receive_message.data[(i - 1U) * 4U + 1U] = 0U;
        receive_message.data[(i - 1U) * 4U + 2U] = 0U;
        receive_message.data[(i - 1U) * 4U + 3U] = 0U;
    } else if(2U == j) {
        receive_message.data[(i - 1U) * 4U + 2U] = 0U;
        receive_message.data[(i - 1U) * 4U + 3U] = 0U;
    } else if(3U == j) {
        receive_message.data[(i - 1U) * 4U + 3U] = 0U;
    } else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }

    return receive_message;
}

/*!
    \brief      write data to the destination array
    \param[in]  src: data source address
    \param[in]  len: data length be byte
    \param[out] dest: data destination address
    \retval     none
*/
static void can_data_write(uint32_t dest[], uint8_t src[], uint32_t len)
{
    uint32_t i;
    uint32_t cnt;

    /* get the word length of the data */
    cnt = (len + 3U) / 4U;
    for(i = 0U; i < cnt; i++) {
        dest[i] = (uint32_t)src[4U * i] | ((uint32_t)src[4U * i + 1U] << 8U) | ((uint32_t)src[4U * i + 2U] << 16U) | ((uint32_t)src[4U * i + 3U] << 24U);
    }

    cnt = len % 4U;
    if(0U != cnt) {
        dest[i - 1U] &= (((uint32_t)1U << ((4U - cnt) * 8U)) - 1U);
    }
}

/*!
    \brief      computes the DLC field value, given a payload size (in bytes)
    \param[in]  payload_size: payload size
    \param[out] none
    \retval     0~15
*/
static uint32_t can_dlc_value_compute(uint32_t payload_size)
{
    uint32_t ret;

    if(payload_size <= 8U) {
        ret = payload_size;
    } else if(payload_size <= 24U) {
        ret = (payload_size - 9U) / 4U + 9U;
    } else {
        ret = (payload_size - 17U) / 16U + 13U;
    }
    return ret;
}
